{
	"students": [
		{
			"Name": "Pradnya Chavan",
			"Roll Number": "CH19BTECH11020",
			"course": "B.Tech",
			"company": "Adobe",
			"profile": "MDSR intern",
			"ctc": "1L PM",
			"rounds": "Three rounds one online test (aptitude + coding + problem solving) and two interview rounds were held for the selection process.",
			"preparation": "First round was about coding and they checked the understanding of algorithms and dynamic programming. Questions on probability, linear algebra and other mathematical concepts were asked so make sure to have a good hold on these concepts. Interview round was about brainstorming on problems and puzzles. These were mostly probability based and the interviewers were dropping hints if stuck. Prepare well on the projects mentioned in the resume and data structures and algorithms.",
			"tips": "I was way too nervous for interviews but from my past experience I just confidently gave my interview not worrying too much about the results and that is what the interviewers liked, they were quite friendly and helped me get my thought process on right track. It will be a great experience and make sure you are conveying your thought process to them as that is what they expect from you rather than getting to the correct solution.",
			"experience": "I started my preparation in the summers prior to internship season but I practiced coding before at a slower pace. I would suggest to start earlier and practice solving a lot of problems within a time limit.  Practicing competitive programming or even solving problems on own pace on websites like GFG or LeetCode will help in clearing the rounds. Can brush up the mathematical concepts (from course work) in the last month which would be more like a revision of those.",
			"branch": "CH"
		},
		{
			"Name": "L Pranay",
			"Roll Number": "AI19BTECH11019",
			"course": "B.Tech",
			"company": "Adobe",
			"profile": "Product intern",
			"ctc": "1L PM",
			"rounds": "There were 2 rounds. First round was a online test and 2nd round was technical interview. \n\nThe online test consisted of 6 sections and was conducted for 2hrs. \nThe first section had 2 programming/coding questions, both were very easy compared to questions of any other companies online test. \nIn 2nd section we had to write an essay of about 200 words about our experience of working in team/while doing a project. In this section they mainly want to know what problems we faced while working in a team/working on a project and how we overcame those problems. \nRest of the sections were MCQs with 5 questions each from ML, Linear algebra, aptitude and theory questions related to computer science.\nThis test was common for Product intern and MDSR intern role, so sections like ML, essays were meant for MDSR intern role.\n\nThe technical round lasted 1hr and for me it was mostly about my projects and theoretical concepts related to Machine learning and deep learning, I got lucky here because the interviewer I got was already working in ML domain, so he was happy to ask questions about the concepts I know well. For others who the attended the interview the questions was mainly based on CP(coding questions) and core CS concepts like OS and DBMS.",
			"preparation": "For the Online test, its easy to crack the coding questions. The MCQs are pretty hard so try to be strong in fundamental concepts. Its better to think of problems you faced and solutions you came up with while doing a project/working in team before the test. If you go through previous year Adobe papers its very clear that they ask students to write an essay. So be ready with the essay before the exam( mainly if you want to apply for research/MDSR intern). \n\nComing to Technical Interview, again be strong with fundamentals and know the projects you wrote in resume very well. As they'll ask questions surrounding concepts of the projects you did. Try to make a good impression with interviewer as that time they won't bother if you mess up few questions. Add some hobbies and extracurricular activities in your resumes as it'll help break the ice.",
			"tips": "Not much tips for online test except have strong fundamentals. \nComing to Technical Interview fundamentals are important but things like the way you introduce yourself are also important. So take proper time making a proper resume and take time learning how to speak in interviews and give a proper intro.",
			"experience": "After the end of 4th semester that is starting of May, I started revising ML and DL concepts as I couldn't understand them properly while the semester was going on. Until the end of July i was reading core concepts, near the mid of July we found out about companies coming to college and we had to start making resumes. From then I started learning how to make resumes and practicing little CP, I already did little CP in my 2nd semester when we got break for covid. If you know a programming language fully and didn't do CP before then its better to start practicing from start of June. We had interviews in first weekend of September. I spent the last 2-3 days learning how to talk in interviews and how to give a proper introduction. So I would suggest to have 2 days free before Interview for preparing for speaking in the interview. ",
			"branch": "AI"
		},
		{
			"Name": "Gorle Varshit",
			"Roll Number": "EE19BTECH11020",
			"course": "B.Tech",
			"company": "Amazon",
			"profile": "SDE",
			"ctc": "80K PM",
			"rounds": "First Round - Online test. It was a general coding test followed by questions on logical reasoning and debugging.\n\nSecond Round - Online Interview. There were 2 panel members and interview was about 25-30 min. It started with me introducing myself to them, and then followed by the projects I had done. Later the interviewer gave me a simple coding question to start off and slowly kept adding few variations to the same question. After getting stuck at one point of time, i explained her my thought process and she helped me in leading to the solution by giving few hints. After i was ready with the solution, interviewers were happy with the code and the way i worked it out to the final solution. This interview didnt include any quesions on OOPS or OS.",
			"preparation": "Being thorough in all the concepts of DSA (including theoretical knowledge) will keep in you a better position throughout the internship selection process. Basic idea of OS and OOPS conceps will help even more. Keeping in mind the time constraint in coding round is important. It's relatively easier in interview round as you can get selected even if you are not able to write the code completely , as long as you are able to explain your thoughts and idea of solving the problem given you have a friendly interviwer :)",
			"tips": "For written (coding) round only suggestion would be to practise as many coding questions as possible from leetcode,gfg,codechef,etc and to have fair knowledge in DSA, and a little of OOPS and OS (although i had no knowledge of these that time). At the start make sure you are able to completely solve the question without any hints, and then slowly start practising keeping a certain time limit which plays a key role for scoring relatively good in coding rounds. Most of the questions asked in the coding round would be of similar models and hence the more the number of questions you practise, more the chance of you doing well. \n\nFor the interview round based on my personal experince, the ultimate suggestion would be not to panic. I read the same lines from ocs internship experiences but didnt understand the importance back then, but i realised its importance when i did poor in one of the interviews for a different company where i was asked a question which i knew and was easy, but then i just paniced so much that i couldn't answer that. We generally tend to panic because we think way too ahead than the current situation. Later that day, i had interview for amazon where i was asked a question which was completely new for me, but then i was just thinking about the problem rather than thinking of what will happen if i dont get a solution. Eventually i was able to solve the problem with the hints given by my interviwer. Also make sure you keep telling about your thought process to the interviwer and only then he/she will be able to give you hints in that direction. Sometimes its fine if you cant completely code as long as you find a way to solve the question.",
			"experience": "I started my preparation relatively late, at around middle of my summer holidays after 4th Semester. I relied completely on gfg's DSA course for learning and later practised various coding problems on leetcode, hackerrank, codechef, etc. Its better to start learning from end of 4th sem (or early if possible), so that you will have ample time to practise questions during summer break. One major challenge i faced was that i knew the concepts but was not able to code within the given time, i did overcome this in due course of time by practising alot of questions online with time limit, and also by writing different mock tests.",
			"branch": "EE"
		},
		{
			"Name": "Chirag Jain",
			"Roll Number": "EE19BTECH11047",
			"course": "B.Tech",
			"company": "Amazon",
			"profile": "SDE Intern",
			"ctc": "80K PM",
			"rounds": "Screening Test: It consists of 4 sections. The total time was around 2 hours. There was an individual time limit for each section.\n\nSection 1 - Debugging: It has seven questions on code debugging. You will be given a code, and you have to find the mistake and fix it. The questions are of easy level.\n\nSection 2 - Coding: It has two questions. The questions are of medium level. These are similar to the ones given on leetcode and GFG.\n\nSection 3 - Workstyle Assessment: It has some behavioral questions. No prior preparation is needed for this section.\n\nSection 4 - Aptitude: It had around 24 questions. The questions were based on Logical Reasoning and Quantitative Ability. They are of easy level. One can easily breeze past this section.\n\nAfter the screening test, there was one round of interview. The interview lasted for 75 minutes. The interviewer asked me about my project in detail, followed by two coding questions. The questions asked were on the Sliding window approach and N-ary Trees.",
			"preparation": "Practicing question form Leetcode , GFG and InterviewBit will help you in clearing screening test of all the companies.",
			"tips": "Have some decent projects on your Resume and make sure you know each and every detail about the project. Do not ignore topics like Dynamic Programming and Graphs algorithms. And lastly, have faith in yourself.\n\nDuring interviews, make sure you think out aloud and convey your approach to the interviewer.",
			"experience": "I started preparing  during the summer break. I solved a decent number of questions from Leetcode and GFG. 1 month before the tests, I started solving InterviewBit. According to me, these platforms are sufficient to crack any coding interview.\n\nGood Luck!!",
			"branch": "EE"
		},
		{
			"Name": "Brijesh Aghav",
			"Roll Number": "CS19BTECH11047",
			"course": "B.Tech",
			"company": "Arcesium",
			"profile": "Software Developer Intern",
			"ctc": "1L PM",
			"rounds": "There was an Online Coding round to begin with. There were 2 questions of easy-moderate level that had to be solved in about an hour. HackerRank platform was used for the test; There are a few public test cases and a lot more private ones.\n\nThen on Day 1 of the Internship Drive, there were 3 Technical Interviews followed by a HR Round. The Technical Interviews tested DSA topics like Graphs, Trees, DP. The final Technical Interview revolved around the projects I had mentioned on my Resume - Fullstack Website & CA Portal for Elan 2021 and COVID Simulation program in C. We discussed about the projects, Technologies I Used for them, Improvements possible and other aspects.\n\nIn the HR Round, following questions were asked: How did you feel about the entire process? Tell me about yourself and your family. What do you know about Arcesium? \nThis round is just a formality in most cases. If you've made it to this round, you'll most likely get the offer.",
			"preparation": "CP should be the topmost priority during the preparation. Try to solve as many Coding Questions as you can. You could start by reading up articles about a particular topic on Topcoder, then practicing Questions related to the topic on Codeforces, SPOJ, or other platforms. Apart from this, You should brush up CS Fundamentals - OS, OOPS, etc.",
			"tips": "In the Online Test round, try to get partial points for a question if you're unable to solve it completely. Since it's essentially a filtering round for the interviews, even being ahead by others by a small margin also matters.\n\nFor the Interview Round, I'd recommend speaking your though process while solving the question. This helps the interviewer understand your approach and he/she/they can provide hints based on your approach or tell you it's wrong. During my 2nd Interview, I was initially going in the wrong direction, but since I was speaking what was going on in my mind, a hint or two from the interviewer were enough to correct the approach. One thing that will help you the most is being relaxed during the time of the interview. One thing that will help you the most is Understanding that the Interviewer is not some evil person ( 99.9% of the cases :D). So don't be afraid of him or hesitate to talk to him if you're stuck for a long time.\n\nAlso as a general advice, try to keep your Resume 1 page long, not more not less. Try to have at least one project in your resume, so the interviewer may have something to talk about apart from asking questions related to DSA. A discussion about a project can give the interviewer insights about your dev skills, technolgies you've used before along with other aspects that cannot be tested by just asking questions.",
			"experience": "I started my preparation after the end of 4th Sem. I had 2 Data Structures Courses in my curriculum along with an Algorithm Course. So I was quite familiar with DSA concepts beforehand. For Coding, I relied on SPOJ initially to solve a few basic questions of each topic. Then once I was familiar with almost all topics, I went for the Codeforces contests which give you a Time Bound Test experience. I used to refer to Topcoder or Codeforces blogs for topics that were new to me.",
			"branch": "CS"
		},
		{
			"Name": "SV Harshith",
			"Roll Number": "EE19BTECH11018",
			"course": "B.Tech",
			"company": "Arcesium",
			"profile": "Software Developer Intern",
			"ctc": "1L PM",
			"rounds": "Round 1 - screening test\nIt was conducted on Hacker Rank platform. It consisted of 2 coding questions of medium level. The questions were slight variations of these -\nQ1 - https://www.geeksforgeeks.org/find-number-of-closed-islands-in-given-matrix/amp/\nQ2 - https://www.geeksforgeeks.org/weighted-job-scheduling/amp/\nAround 12 students were selected to the next round.\n\nRound 2 - First technical interview \nThe interviewer was very friendly and first asked me to introduce myself, after that he asked some easy questions about BFS and DFS traversals of a graph and I had to implement them and after adding some minor variations to it he built it up to a big algorithm.\n\nRound 3 - Second Technical interview\nIt consisted two panelists asked various miscellaneous questions about data structures and 3-4 coding questions like -\nhttps://www.geeksforgeeks.org/given-a-sequence-of-words-print-all-anagrams-together/amp/\nAnd a puzzle -\nhttps://www-geeksforgeeks-org.cdn.ampproject.org/v/s/www.geeksforgeeks.org/puzzle-9-find-the-fastest-3-horses/amp/?usqp=mq331AQKKAFQArABIIACAw%3D%3D&amp_js_v=a8&amp_gsa=1#referrer=https%3A%2F%2Fwww.google.com&csi=0&ampshare=https%3A%2F%2Fwww.geeksforgeeks.org%2Fpuzzle-9-find-the-fastest-3-horses%2F\n\n4th round - Third technical interview\nThis round was all about my projects, I had to explain the inside working of my projects in detail and he then asked some questions on the data structures I used.\n\n5th round - HR interview\nAfter introducing myself she asked some basic HR questions like what do you like about our company?, How were the interviews and the experience? etc.",
			"preparation": "Practice as many problems as possible on different concepts like arrays, dynamic programming, graphs, trees, hashing etc.\nSince I was from electrical background I didn't get any questions from OOPS and OS concepts, but these are also very important topics to prepare.\nLook for different interview experiences of various people online and get to know the common questions the company asks in their interviews.",
			"tips": "In my opinion the first screening test is usually the hardest, consisting of very hard questions generally. Practicing many programming is the only way to get shortlisted for companies.\nThe time may not be sufficient for the screening test so answer as many questions as you can.\nThe interviewers are very friendly and if you get stuck in any question just ask some hints.\nThey mainly focus on your thinking process and even if you can't answer a question don't panic just try to explain the approach and they will provide some hints.\nIf you are doubtful about your approach just ask them if you are on the right track and they are always ready to help you.",
			"experience": "I started learning competitive programming about two months before the internships started and I focused on learning data structures and algorithms.\nI started reading about the OOPS fundamentals and OS concepts like Mutex, Semaphores, Paging, Virtual Memory etc. online and took help of the many playlists available on YouTube. Be confident in these concepts as they are easy to score points for you in the interview.\nI mainly used geeks for geeks platform for learning and practicing programming.\nLeetcode is also a good website which has many questions.\nAt start I wasn't able to solve most of the questions and used to the look at the solutions but slowly I started to solve the questions and gained some confidence.\nTry to maintain a good CGPA and have some nice projects on your resume.\nDon't bluff anything on your resume , you should be able to answer every point you write in it.\nThe long interviews maybe tiring but just stay cool and answer calmly so that you don't regret it afterwards.\nGood luck and All the best!",
			"branch": "EE"
		},
		{
			"Name": "Prakhar Pragya",
			"Roll Number": "CH19BTECH11036",
			"course": "B.Tech",
			"company": "BNY Mellon",
			"profile": "Software Developer Intern (Summer) ",
			"ctc": "60K PM ",
			"rounds": "There was One screening test followed by Two Interview Rounds -  Technical and HR\nScreening test - There were overall 4 Coding questions. 1 of them of easy level and the other 3 were of moderate level. The easy one was to be solved on python where you had to find the closest distance from a given set of points. The others I solved on C++. One was based on DP and the other was on Greedy Algorithms. I don't remember the last one.\n\nTechnical Interview round: I was asked short answer questions related to python and C++. I was also asked about the methodology on how I solved the questions in the screening rounds. The interviewer then asked questions related to my projects and a few basic questions on Machine learning as I had done a project on that. He then gave a question on DP which I wasn't able to solve first but then he gave me a hint and I was able to solve it. After that he recommended me for the next round\n\nHR Interview round: I was asked to explain one of my projects. I explained my project on recommender systems. He then asked about my life goals and strengths and weaknesses. \n\nBoth the interviewers were very friendly and helpful. ",
			"preparation": "I practiced questions on LeetCode and GeeksforGeeks for the screening test. For the technical interview round, I read interview questions on GFG. Youtubers like Aditya Verma were of great help.",
			"tips": "Practice. The more you practice the more you can learn time management and get confidence. Stay calm during the written and interview rounds. That's it.",
			"experience": null,
			"branch": "CH"
		},
		{
			"Name": "Nishita Pattanayak",
			"Roll Number": "ai19btech11024@iith.ac.in",
			"course": "B.Tech",
			"company": "BNY Mellon",
			"profile": "Software Developer Intern",
			"ctc": "60K PM (6mo)",
			"rounds": "Round 1:\nOnline Coding Round : The round was conducted on Hackerrank which was of 1.5 hr .  It had 4 coding questions each on a different concept. Most of the questions were different for each attendant. The concepts on which most of the questions were based on are basic dynamic programming, binary search trees, Sorting and other data structures.\nAll of them were of easy-medium difficulty.\n\nRound 2:\nInterview round 1: 2 coding questions + 1 debugging question conducted on codepair (hackerrank) . Coding questions tested the candidate's understanding of vectors, maps , Sorting and also data structures like stacks and Arrays.\n\nInterview Round 2: The interviewer focused mostly on my knowledge in python and the projects I had mentioned on my resume. It was a HR + technical round.\n\nInterview Round 3: It was a bar-raising interview. The interviewer tested my in-depth knowledge of concepts taught in AI focusing on Image and video processing.  This was by far the most difficult round. \n\n",
			"preparation": "For most of the rounds practicing DSA is very important.  Get yourself prepared with basic fundamentals like OOPS , OS, DBMS. Try solving problems on different concepts before the test so that you have an idea about your strengths and weaknesses.  Sorting Algorithms are very important and fundamental which will be asked in almost any interview / coding round.",
			"tips": "Make sure you practice coding on platforms which do not have autocomplete features since that will be disabled. Make sure you are clear with fundamental concepts as they make you a strong candidate.  Make sure you keep conveying what you are thinking to the interviewer , this helps interviewer understand your approach and to help you out. Do not worry even if you go wrong as the interviewer is always there to help. In most cases they re always very helpful and can even tell you some tips so keep it like a discussion rather than a question- answer session.",
			"experience": "I have mostly used hackerrank, geeksforgeeks, leetcode and interviewbit for my preparation.  Going through interview experiences on gfg also helps understanding the difficulty level of the rounds and the concepts you need to practice.",
			"branch": "AI"
		},
		{
			"Name": "LAKKU NALINI AISHWARYA ",
			"Roll Number": "EE19BTECH11033",
			"course": "B.Tech",
			"company": "Goldman Sachs",
			"profile": "SUMMER ANALYST",
			"ctc": "1.5L PM",
			"rounds": "Online Screening Test:  The test had 3 coding questions(2 medium+1 advanced),  a computer fundamental section, a section on probability, a puzzles section and 2 behavioral questions. Students who were selected had to attend 3 rounds of technical interviews on zoom.\n\nRound 1:It was an interactive session conducted on code-pair(Hackerrank). It started off with a brief introduction of myself. Then we jumped onto coding questions. I was asked to write functions for various basic stuff such as height of a binary tree, implementing a binary tree from scratch, circular lists etc... Then the interviewer wanted to discuss my approach to some problems such as kth smallest element in an array and such similar problems and following it, was asked to write a pseudo code. The round ended with her opening the floor for any questions.\n\nRound 2: The interviewer started off by formally introducing himself. I was asked to brief him about any one of the projects on my resume. Then moving onto the coding part: the question was \"Merging n sorted arrays\". We had a long discussion about various ways in which we could solve this, and also the complexity of each solution.\n\nRound 3: (Final Round) The interviewer was quite friendly and told me to go through the interview comfortably. He introduced himself and talked about his line of work at the company. It followed with an introduction of myself. He went on to ask me the differences between various sorting procedures, their pros and cons. Similarly the uses ,pros and cons of heaps and binary trees. It was a long discussion which also included red-black trees. For the last question, it was based on computer architecture-mainly memory, i.e sorting a larger file with smaller RAM. Initially I was stuck, but with a few hints from him, I was able to figure it out.",
			"preparation": "Since competitive coding plays a major role and you have to code in real time, you have to practice coding faster and also ensure that it's error free. Time your coding to monitor your progress. Go through the theory once in a while. Take mock interviews to assess your skill. Also make sure that you have a basic grasp on all your projects you mentioned in your resume. Something that would help is to plan the key-points of your introduction. I would advice against memorizing an introduction by-heart, you don't want to sound too mechanized.",
			"tips": "Since your resume also plays a role in screening, maintain a decent CGPA( at-least above 8, this is eligible for many companies.)\nIt's better to have a good grasp on the computer fundamentals(OOPs, DSA, Computer architecture, OS.)\nTry to pass as many test cases as possible in the online test.(The solution doesn't always needs to be optimized. Even a brute force solution can pass many test cases.)\nTry to be calm while giving the interviews. Most of the interviewers are friendly and supportive. While coding keep explaining your approach to the interviewer, so if you are stuck, they can help you out.",
			"experience": "I started the preparation a couple of months before the whole internship saga. I mainly used Leetcode to practice CP. I also used to take part in its weekly and bi-weekly coding contests but not very frequently. I also used InterviewBit, GeeksForGeeks. GeeksForGeeks has a good collection of company-specific problems and also an archive of interview experiences.",
			"branch": "EE"
		},
		{
			"Name": "Shubam Agarwal",
			"Roll Number": "CS19BTECH11029",
			"course": "B.Tech",
			"company": "Goldman Sachs",
			"profile": "I don't know",
			"ctc": null,
			"rounds": "Online test , then 5 interviews ( 1 DBMS , 2 CP , 2 quant related questions)",
			"preparation": "For DBMS and OS college coursework is sufficient. Prepare basic questions of CP especially top 10 dp questions from gfg.  For quant rounds no theory is required. Make sure that you discuss your approach with the interviewer and ask for hints when stuck.",
			"tips": null,
			"experience": null,
			"branch": "CS"
		},
		{
			"Name": "Rahul S",
			"Roll Number": "AI19BTECH11002",
			"course": "B.Tech",
			"company": "Google",
			"profile": "Software development",
			"ctc": "98K PM",
			"rounds": "1 coding round (1 hr ,2 questions) followed by 2 45 min coding interviews. ",
			"preparation": "competitive programming/DSA skills are the only thing required.",
			"tips": "Practice coding.(interview bit/leetcode/codeforces/spoj/cses.fi/hackerrank/hackerearth/codechef)",
			"experience": "I started CP(competitive programming) after the end of my 1st year. Did not specifically prepare anything before the internship rounds.",
			"branch": "AI"
		},
		{
			"Name": "Pakala Srijith Reddy",
			"Roll Number": "EE19BTECH11041",
			"course": "B.Tech",
			"company": "Intel",
			"profile": "Title : Hardware semester Intern Period: 6 Months",
			"ctc": "40K PM",
			"rounds": "Round 1: Resume shortlisting based on the coursework, project in relevant areas and other details mentioned in CV.\nRound 2: 1 on 1 Interview, The Interview started off with the introduction from Interviewer, We talked about my college life and other details. He started off with basic questions from electrical circuits, next some questions or rather discussion on MOSFET characteristics, theory and then went onto discuss some circuits like inverters involving PMOS and NMOS. He asked me about the what topics were covered in analog and semiconductor courses, we next discussed control system topics and basics like phase margin, stability and how they are used in analyzing amplifiers and the type of amplifiers I know and next some Butterworth filter equations. Next we discussed on some basic questions from probability, random process like gaussian distribution area related questions and how they apply in the analog circuit design errors. \nNext we had a light discussion on Latches and  Flipflops, I didn't answer 1 or 2 questions in these areas, so he moved onto communication system and discussed some basic topics like Frequency modulation and amplitude modulation. I think we discussed almost every courses I mentioned in my CV although main focus was analog circuits. \nNext he asked me about my family, hometown and hobbies. He then asked me my future plans as to higher education and my area of interests. He then explained what the job is about and the department area of working. The interview was supposed be 1 Hour but we talked for about 1Hr 45Min.He ended the interview saying they will contact me and inform the results.\n",
			"preparation": "For resume shortlisting make sure to mention all the coursework you have done relevant to the job and be clear on your interests. It would help if you have done any related projects .\nFor the interview round ,Know your way around the projects and areas you mentioned in the resume as most discussion runs in that direction. Revise all the basics and theory and you should have at least some in-depth knowledge in the things you mentioned in the Resume.",
			"tips": "Be clear when answering the questions in interview. If you don't know something or stuck take minute or two but not too long as it won't do any you good and will only take up your time to discuss other questions or areas you might be good at. Try to get vibe of the interviewer and the things he's responding to you well. Try remembering happy things before interview and start with a smile on your face.",
			"experience": "It would be more than enough if you go through basic chapters Design of Analog CMOS IC by Behzad Razavi for analog topics. I started revising the basics 2 days prior to interview.\nI suggest you keep a grip on all the relevant courses frequently in your semesters itself rather than last minute Preparation or do some related projects in free time.",
			"branch": "EE"
		},
		{
			"Name": "Nikhil P",
			"Roll Number": "EE19BTECH11026",
			"course": "B.Tech",
			"company": "Intel",
			"profile": "Undergraduate Intern",
			"ctc": "60K PM",
			"rounds": "One-on-One interaction with a project lead from Intel, after shortlisting through resume. The interaction lasted for around an hour.",
			"preparation": "I was shortlisted for the interview because of the numerous AI/ML projects that I had in my resume. For the one-on-one interaction, I would suggest that you be through with the basics of electrical engineering, along with whatever you put in the resume. Most of my interview questions was based on AI, especially NLP. ",
			"tips": "Be truthful about how much you know. Try to explain concepts as simple as possible and be confident with whatever is in your resume.",
			"experience": null,
			"branch": "EE"
		},
		{
			"Name": "Rithvik Kondapalkala",
			"Roll Number": "CS19BTECH11038 ",
			"course": "B.Tech",
			"company": "KLA TENCOR",
			"profile": "High performance Computing( 6 months )",
			"ctc": "1L PM (6mo)",
			"rounds": "There are around 4-5 rounds , first is Written test,Contains 1 coding question and some multiple choice questions.Then technical interview .second round they asked me some puzzles and how to solve it.In next round ,interview they explained me about role and asked me to write code for matrix multiplication.Another person came and asked me some questions on Os, computer architecture etc..final is hr round they asked me whether I like the role.They told me I am hired in interview itself",
			"preparation": "I started my preparation in May 2021 I thought it was late .Initially I was solving in codechef .In June I started solving problems in Greek for greeks .Frankly speaking Greek for greek is the best place to prepare for interview.I got same questions in  my flipkart interview as well.",
			"tips": "Say what you know .Say NO if you don't. They will explain you if you don't and ask questions .You should prepare for OS .Start greek for greeks right now.All the best",
			"experience": "Greeks for greeks",
			"branch": "CS"
		},
		{
			"Name": "K R Sai Pranav",
			"Roll Number": "AI20MTECH14013",
			"course": "M.Tech TA",
			"company": "Legato Health Technologies",
			"profile": "Intern software engineer ",
			"ctc": "1.5L PM",
			"rounds": "2 Simple coding questions in the first round. In First technical round questions were more on python programming and basic machine learning. Final technical/HR round was based on projects and work experience. ",
			"preparation": "Have a good coding background in python and revise the basics of machine learning. ",
			"tips": null,
			"experience": null,
			"branch": "AI"
		},
		{
			"Name": "Yash Dahale",
			"Roll Number": "ME19BTECH11050",
			"course": "B.Tech",
			"company": "LotusDew Wealth and Investment Advisors Pvt. Ltd.",
			"profile": "Spread Trader",
			"ctc": "15K PM + Sponsored NISM SERIES VIII, Equity and Derivative Certificate",
			"rounds": "Shortlisting from resume and interview ",
			"preparation": "Interview was focused on past experience in securities market and trading psychology. I had past experience in trading, so that helped me a lot. ",
			"tips": "Basic knowledge of securities market is needed. Past experience in this domain is a perk. ",
			"experience": null,
			"branch": "ME"
		},
		{
			"Name": "Ashutosh Chaurasia",
			"Roll Number": "ME19BTECH11045",
			"course": "B.Tech",
			"company": "Lotusdew Securities and Wealth",
			"profile": "Trainee Trader",
			"ctc": "15K PM",
			"rounds": "1st Round: CV; 2nd Round: Technical Interview; 3rd Round: HR Interview",
			"preparation": "CV details should be inclined towards finance, For technicals, they can throw up mental maths + financial questions.",
			"tips": null,
			"experience": null,
			"branch": "ME"
		},
		{
			"Name": "Md Nazish Kaunain",
			"Roll Number": "ES19BTECH11006",
			"course": "B.Tech",
			"company": "Microsoft",
			"profile": "SDE",
			"ctc": "80K PM",
			"rounds": "1st round was an online test. It was mostly competitive programming questions. The topic were mostly from basic Data Structures. The questions did not touch upon the difficult topics like graphs. The next round was a 3-hours long interview. There were three rounds in it. The first one was a very basic coding round. All the questions on the basic array manipulations. The second round was mainly focused on my projects that I had mentioned in my resume. I was asked questions like what was the most difficult tech related problem that I faced in my project. Also, in this round I was asked coding questions on Linked lists, like reversing a linked list. Third round was again a coding round, and it was a bit tricky one. I couldn't solve the problem. It was a gaming related competitive programming problem.",
			"preparation": "In my opinion, the only methodology that works for most of the companies is practicing DSA questions as much as possible.",
			"tips": "For the interview round, it is very important that when you are solving a question, be prompt, discuss your approach with the interviewer (coz it may save time if your approach is wrong, and the interviewer corrects you), and never hesitate to ask for a little help if you get stuck while coding.",
			"experience": null,
			"branch": "ES"
		},
		{
			"Name": "Tadipatri Uday Kiran Reddy",
			"Roll Number": "EE19BTECH11038",
			"course": "B.Tech",
			"company": "NVIDIA",
			"profile": "Hardware Intern",
			"ctc": "50K PM",
			"rounds": "Round I, Screening Round\nIt was conducted on HackerRank platform. Mostly consisting of Fill in the Blanks and Integer type. The marking scheme had negative marks as well.\n-> C Programming\nQuestions on basic syntax, pointers, addresses and memory size on various data types.\n-> Digital design\nQuestions on Boolean algebra, FSMs*, FlipFlops, computer architecture(with more emphasis on Cache memory*) and Static Timing Analysis*.\n-> Analog design\nQuestions on MOSFETs and CMOS inverter.\n\nOnly three members were shortlisted to next round.\n\nRound II, Technical cum HR Round\nThey were three panelists. I was asked to introduce myself then it started off with a interactive talk about my college life and situations amid pandemic. Then I was asked more technical details about my mentioned projects. I was asked to implement one of my project in VERILOG and later they asked me about CMOS Inverter characteristics. Finally they asked me to explain an efficient way to solve the below problem. \n\"Find next greater number with same set of digits - GeeksforGeeks\" https://www.geeksforgeeks.org/find-next-greater-number-set-digits/amp/",
			"preparation": "-> Digital design\nRevise the concepts of Digital System Design learnt in courses.\nRead Computer Architecture from “ Digital Design and Computer Architecture by Sarah L. Harris and David Harris”.\nHaving knowledge on  Hardware description language is an added advantage. The below website is a good place to start with\nhttps://hdlbits.01xz.net/wiki/Main_Page\n\n-> C programming\nBe clear about pointers, address, memory size of famous data types and differences between post-increment and pre-increment.\n\n-> Analog design\nConcepts learnt from academic courses would suffice. MOSFETs are very important.",
			"tips": "Time given for Screening round will not be sufficient to attend all questions but don’t be tensed try to attempt as much as you can but also beware of Negative marking.\nInterviewers are polite and the discussion will be interactive. Be prepared to answer any question asked from Resume and most importantly do not mention any project which you were part of but do not have much technical knowledge.",
			"experience": null,
			"branch": "EE"
		},
		{
			"Name": "V NIKHILESH",
			"Roll Number": "ES19BTECH11030",
			"course": "B.Tech",
			"company": "Oracle",
			"profile": "Application Development",
			"ctc": "1L PM",
			"rounds": "About the online Test:-\nThe online test consisted of total 4 sections:-\n1) Basic questions on DBMS and Operating Systems\n2) Aptitude\n3) English\n4) Computer Science (DSA,OOPS,C,C++)\nEach of the four sections had dedicated time window in which the section needs to be completed.\n\nThere were total 3 rounds in the Interview:\n\nFirst round:\nFirstly the interviewer gave me a coding question which was about wave array(https://www.geeksforgeeks.org/sort-array-wave-form-2/) and I had used inbuilt sort function of STL library for solving this question. Later the interviewer asked about the inbuilt sort function (merge sort) and told me to implement it. I implemented it and explained the algorithm to the interviewer. The interviewer was satisfied and this was end of round 1.\n\nSecond round:\nThe interviewer asked me to introduce myself and then asked me about my projects. I had done a web development project which I explained to the interviewer and after that I was asked the following question :- https://leetcode.com/problems/subarray-sum-equals-k/. This was end of the second round.\n\nThird round:\nThis round was a HR round in which I was asked the following questions:-\n1) Why do you want to join oracle?\n2) Have you attended any previous interviews and how did they go?\n3) Explain your project?\n4) Tell me something about your family and why did you choose engineering?\nThis was end of the third round.\n\nFinal verdict :- I got selected for the APPS role in Oracle ",
			"preparation": "For coding questions practice questions from leetcode which are very useful for interviewer rounds and start giving contests on codeforces which will help for coding tests of other companies. For leetcode questions you can use the following sheet :- https://docs.google.com/spreadsheets/d/1-wKcV99KtO91dXdPkwmXGTdtyxAfk1mbPXQg81R9sFE/edit#gid=0\n\nAlways try to upsolve after giving contests on codeforces.",
			"tips": "Stay calm and answer all the questions confidently and be friendly with the interviewer.",
			"experience": "I started my preparation during the semester break(May,June,July). I started solving the questions from the sheet mentioned above. I could not solve many question at the begining but instead of getting demotivated I kept solving and I could solve many of the questions in the coding tests that I appeared during my internship selections.",
			"branch": "ES"
		},
		{
			"Name": "Rohith Ingilela",
			"Roll Number": "EE19BTECH11005",
			"course": "B.Tech",
			"company": "Oracle",
			"profile": "Develooer in Server Technology",
			"ctc": "1L PM",
			"rounds": "1) Coding Test in oracle specific website\n2) Interview 3 rounds\n   Round 1 - General/Aptitude\n   Round 2 - Technical (need to write code live + basic computer science questions) \n   Round 3 - HR",
			"preparation": "Practice previous questions a lot. Leetcode website is one good website for that. \nFor interview learn about the company and more details about your specific role. Make sure your answers are relevant to the role and be honest. ",
			"tips": "Prepare a lot but take some rest before the D-day",
			"experience": null,
			"branch": "EE"
		},
		{
			"Name": "Naitik Malav",
			"Roll Number": "cs19btech11026",
			"course": "B.Tech",
			"company": "Oracle",
			"profile": "Applications Development",
			"ctc": "1L PM",
			"rounds": "Round-1 - 3 easy coding questions(Kadane's algo based) and 3 puzzles(all from gfg)\nRound-2 - 4 medium coding questions and 4 puzzles(all from gfg).\nRound-3 - HR round, asking hobbies, and asking previous experience. ",
			"preparation": "In short Practice DSA.. Keep revising questions.. Make notes.. Be specific with what you are learning. Do not try to do each and every thing available on internet. It's wastage of time.\n\nFor methodology you can watch several youtube videos and you can come up with your own. Do not follow them as it is. Make your own. ",
			"tips": "Go through the previous experiences of each company available on gfg. Most of the time they follow same pattern. \n\nIn interview rounds do not panic and asks more time. In my case I am unable to solve 1 puzzle in every round, so I ask them can you ask me another puzzle? And both of them agreed. So don't panic if you don't know the answer.\nAlso If you think that you didn't explain him/her properly then don't worry ask them politely can I explain you 1 more time or can I start again. They also cooperate with you. \n\nDo not mention anything in resume that you don't know. They also ask you about your hobbies. ",
			"experience": "I have started in may 2nd week. I had no idea when is the exam what's the process. Complete blank. I am thankful to my batchmate who called me and explain the process.\n\nThere's one famous sheet of 450questions by Love babbar, try to do as much as possible. It has almost all the necessary DSA questions and they are categorized which is very helpful for people like me who have never done any CP, never participated in any contest.\n\nFor dynamic programming/two pointer/stacks/etc. you can watch Aditya Verma's playlist. At least watch all the dp videos. In my opinion it's best. \n\nIf you think you are taking a lot of time in solving a question do not worry it's normal. In starting you'll face but at the end you'll be pro. \n\nDo not hide anything from your friends, whatever you are learning, watching share it with your friends. In my opinion it should be done in a peer to peer manner.\n\nKeep asking your friends and seniors whether you are on a right path or not. I have wasted a lot of time in starting doing leetcode questions without programming knowledge. Do not hestitate in asking/sharing strategies with others.\n\nAt last if you are still confused just go through the practice section of interviewbit. Few companies directly copy paste question from interviewbit.\n\nAll the best :)",
			"branch": "CS"
		},
		{
			"Name": "SAHUKARI CHAITANYA VARUN",
			"Roll Number": "EE19BTECH1104",
			"course": "B.Tech",
			"company": "Oracle",
			"profile": "Server Technology Intern",
			"ctc": "1L PM",
			"rounds": "Total Rounds : 1) Technical Test : Had questions spread across various domains of CS concepts. Had two coding questions, each to be written  in a different language.  2)Technical Interview - Round 1 : Had basic questions on Sorting, a couple of IQ questions easy enough to answer. 3)Technical Interview(more personal) - Round 2 : Discussion of projects in depth and reacting to the situations based on experience. Further interests and aiding of the company in them.",
			"preparation": "For technical rounds practice cp on interviewbit or leetcode and be thorough wth the standard questions. For interview rounds, be calm, stay in the moment and explain your answer clearly. Try to solve even if you dont know how to solve, the approach is appreciated than the result. Be thorough with the projects you list on the resume.",
			"tips": "Try to be cool and confident all the time. Get your hands dirty with any platform say gfg or leetcode or interviewbit. Dont waste time on comparing the platforms, at the end of the day it only matters how good you are able to solve. I prefered Interviewbit as the clock will be ticking giving experience for the real time interviews. I was not having lot of time to invest as I had to complete my sophomore internship, hence choose general basic questions to solve. Trying to generalize the problems would help in boosting the speed. Practicing more problems on dynamic programming and graphs helps to score well in the tests. All the CS concepts cn be revised with help of gfg.",
			"experience": "I started doing cp 2 months prior to the tests in the summer break, but wasnt very consistent. I had to manage the sophomore internship and practice cp and dev stuff, but planning out things and trying to think regularly gives the flavour of cp. Whenever I am stuck, I will try to jot own the kind of problems I am facing the issue and worked on it longer.",
			"branch": "EE"
		},
		{
			"Name": "BOJJA CHARITHA REDDY",
			"Roll Number": "EE19BTECH11001",
			"course": "B.Tech",
			"company": "Oracle",
			"profile": "Project Intern - FSGBU",
			"ctc": "1L PM",
			"rounds": "The online test had 4 sub-sections:\n1) Coding\n2) Contextual Communication(English)\n3) Aptitude\n4) Technical\n\nEach of the sections had certain time limit. You must be quick enough to answer them and all of them were MCQs. Students were then shortlisted for different profiles based on their performance in the online test.\n\nNext came the D-day (Interviews): \nRound-1: The interviewer asked me few technical questions. Then, she started asking questions based on my resume. I explained her about one of my projects which was related to web development where I developed a multi-page responsive website. Later, she asked me few questions related to SQL. This was the end of Round-1\n\nRound-2: After round-1, based on my performance, I was called for Round-2. In this round, the questions were mainly based on my resume and some general questions like: 'Tell me about yourself!', 'How would you equally divide work among the teammates when you are working in a team without putting all the work on yourself and maintaining healthy relations with the teammates?', 'What are your strengths and weaknesses?'. This round was interactive. Lastly, he asked me if I had any questions for him.",
			"preparation": "Start practicing coding(C++) at least 3 months prior your online test. I know most of you are confused about where to start. I would suggest you to prefer learning basic concepts and Data Structures from geeksforgeeks. Also, participate in codechef or codeforces coding contests. Have some basic knowledge related to OOPs, OS, DBMS related concepts. Practice coding with your friends as learning together helps you in optimizing the code.",
			"tips": "Don't get tensed. Frankly let the interviewers know if you are stuck somewhere. They will definitely help you out. You must be ready to explain each and every point mentioned in your resume. Stay calm throughout the interview.",
			"experience": "I preferred learning CPP programming from this link: https://practice.geeksforgeeks.org/batch/fork-cpp . I started coding a bit late. So, I was worried if I can solve the coding questions in time. But don't worry. Practice as a group and learn debugging. Learn basics first and practice CP regularly. ",
			"branch": "EE"
		},
		{
			"Name": "Charan Pamuru",
			"Roll Number": "ES19BTECH11012 ",
			"course": "B.Tech",
			"company": "Providence Global",
			"profile": "Sde",
			"ctc": "40K PM",
			"rounds": "1st round: coding round of about 2 hrs with 3-4 coding questions. These questions are standard questions that are available on most prepartion websites.\n2nd round: Technical round of about 30 minutes. The interviewer asked me basic questions about stuff that I had put on my cv.\n3rd round: coding round in front of an interviewer. Explain your thought process to the interviewer while coding and try to get a solution out of possible.\n4th round: HR round. Be yourself and answer questions honestly.",
			"preparation": "Practice for coding rounds by doing standard questions and improving your logic building. Prepare for what they will ask and what to say in interviews.",
			"tips": null,
			"experience": "Leetcode, interview bit and other coding sites helped out. I started about 2 months before the start of internship exams. First, I had to get my concepts straight by revising DSA. I maintained a seperate notebook/doc to put down info that seemed important and would be important for revision.",
			"branch": "ES"
		},
		{
			"Name": "Ronak Devda",
			"Roll Number": "EE19BTECH11023",
			"course": "B.Tech",
			"company": "Qualcomm",
			"profile": "Interim engineering Intern (SW)",
			"ctc": "45K PM",
			"rounds": "1 Technical test \n2 Technical interview ",
			"preparation": "For Technical test - practicing is the key \nFor Technical round- Don't lie in resume ,Be Honest you can fake something's but  in most of the cases it won't work.",
			"tips": "Be Confident , ask for hint or further clarification if you got stuck at some point.",
			"experience": "Just use one site(I followed Interview bit) rather than getting confused by lots of content . \n\nBE GENTLE WITH YOURSELF \nSUCCESS TAKES TIME !\n",
			"branch": "EE"
		},
		{
			"Name": "Shubham Jain",
			"Roll Number": "Sm20mtech12007",
			"course": "M.Tech",
			"company": "Robert Bosch",
			"profile": "AI Engineer",
			"ctc": "35K PM",
			"rounds": "One telephonic interview",
			"preparation": "Should have good AI related projects on resume with in-depth understanding. Experience with robotics is a plus.",
			"tips": null,
			"experience": "CS229 by Andrew Ng for ML, NPTEL lectures by vineeth sir for deep learning, fee extra courses from Coursera by HSE university and Andrew Ng",
			"branch": "SM"
		},
		{
			"Name": "Rohan Kaushik",
			"Roll Number": "SM20MTECH12001",
			"course": "M.Tech",
			"company": "Robert Bosch",
			"profile": "Hardware Trainee",
			"ctc": null,
			"rounds": "Telephonic interview ",
			"preparation": "Asked about projects and thesis work mostly.",
			"tips": null,
			"experience": null,
			"branch": "SM"
		},
		{
			"Name": "Jai Goyal",
			"Roll Number": "cs19btech11027",
			"course": "B.Tech",
			"company": "Salesforce",
			"profile": "Software Intern",
			"ctc": "90K PM",
			"rounds": "First round was an online test, it consist of 3 questions to be solved in 90 min. Around 20 candidates were selected for the next round. Next round was technical interviews. In my first interview they asked about OOPS concepts like virtual functions, polymorphism etc and asked me to use these concept in real life. Next, they gave me a 2 coding problem which i was able to code while explaining it. I got selected in the next round, where they asked me about my projects and PORs in deep. He didn't ask any coding questions but asked some theoretical questions about space bound. At last, I asked few questions about the work culture and got selected after that round. ",
			"preparation": "Start as soon as possible, first start slowly then increase your pace. Leetcode, interviewbit, gfg all are good resource but do the questions on your own and if stuck look at the solutions and then code it. In the interview also, they don't expect you to know everything, if you are stuck in between you can ask the interviewer for hints or maybe change the question. Also, even if you know the question asked in the interview don't right away jump to the optimal question, try to build the solution and explain it properly to the interviewer. Just prepare well, and do your best. ",
			"tips": null,
			"experience": null,
			"branch": "CS"
		},
		{
			"Name": "Soumi Chakraborty",
			"Roll Number": "ES19BTECH11017",
			"course": "B.Tech",
			"company": "Salesforce",
			"profile": "Intern Software Engineer",
			"ctc": "90K PM",
			"rounds": "The first round was an online exam. The three DSA questions were rather simple, and included questions about substrings and possible paths in a 2D matrix. \n\nThere were two interview rounds, one right after the other. In the first one, I was asked to describe the projects in my CV in detail and they even asked me a few in-depth questions about the work I did in my previous internship. They also asked me how I ended up working on the projects mentioned in my CV and why I was interested in them. After that, we moved on to the coding part of the interview. I was given a graph question based on Dijkstra's algorithm. I spent around 30-40 minutes working through this and the interviewers pushed my thinking towards the right direction by asking intuitive questions. In the end, my solution didn't execute completely due to an indexing error in the test cases but since my logic was correct they let it pass and moved on. This was followed by a few short questions about OOP concepts and some questions about Networks. However, once I told them the Networks course hadn't been covered in my curriculum yet they dropped it and told me to continue to the next interview.\n\nThe next interview was a short HR/critical thinking one. I was asked a few questions about my future goals and motivations, and given a logic puzzle. Here's the puzzle if anyone's interested: you are given three baskets labelled Apples, Oranges and Apples + Oranges. However, each basket is mislabelled. You are allowed to pick only one fruit from just one basket. Which basket will you pick and how will you correct the labels based on this pick?",
			"preparation": "The online test and the technical interview both relied on core DSA concepts. Be thorough with graphs, linked lists, trees, traversal algorithms, and dynamic programming.",
			"tips": "For the written round, work smart before you work hard. One question though solvable was pretty lengthy. I realised I could use the test cases to my benefit to come up write a quicker solution so I worked backwards and scored full.\n\nFor the interview round, thinking out loud and is absolutely crucial. When I was given the graph question, I didn't keep a single thought to myself. This greatly helped both me and the interviewers because they could gauge my problem solving skills and nudge me towards the right solution at the same time. While coding, any time I got an error I tried to stay calm and printed variables to locate the error. They commented on my debugging skills due to this rather than judging the errors. Being honest and admitting when you're stuck also helps. At one point, I even told the interviewers that I knew the solution called for Dijkstra's algorithm but I didn't remember the algorithm itself. They told me to forget that such an algorithm exists and asked me to create my own solution. They were very friendly and kept cross-questioning me throughout and constantly tried to put me at ease. The entire interview felt like a semi-formal chat with a senior or a colleague.",
			"experience": "I had two data structure courses and an algorithms course as a part of my curriculum. I brushed up on these concepts and watched a few YouTube lectures from channels like Abdul Bari for revising. For coding practice, I did a few questions from the GFG archives for a few weeks before the exams. I'd suggest having a group of friends to discuss questions with. I did so with two of my friends and this helped me way more than any individual prep I did because it exposed me to many more questions and methods. Preparing with friends also helped my anxiety greatly because it reminded me that everyone was in the same boat and I wasn't alone.\n\nI also had next to no experience with CP (and honestly I still don't) before I started preparing but was still able to perform reasonably well in the tests and interviews so try not to get discouraged or overwhelmed when you start your prep. Do what works best for you and try to keep a level head throughout the process.",
			"branch": "ES"
		},
		{
			"Name": "ARSALAN AHMAD SHEIKH",
			"Roll Number": "ES19BTECH11025",
			"course": "B.Tech",
			"company": "Samsung Bangalore",
			"profile": "Software developer",
			"ctc": "50K PM",
			"rounds": "First round was coding round.\nIt had 3 questions. I remember just one. It was a binary tree. And if a node was equal to the sum of the 2 children and both its children also satisfy the condition, return true else false.\n\nSecond round interview.\nAsked some easy questions. First was Floyd's Cycle-finding in a linked list. Second was 2d array shortest path finder. 3rd I don't remember.\n\nThird interview round.\nThis is a more technical round. They don't ask you a lot of DSA here. Just keep some projects handy and know every bit about the project. That should be enough to qualify the second round.\n",
			"preparation": "First round.\nDSA\n\nSecond round.\nDSA + OS, Networking, etc\n\nThird round.\nProjects.",
			"tips": null,
			"experience": "Abdul Bari and HackerEarth questions",
			"branch": "ES"
		},
		{
			"Name": "Sidharth Udayan",
			"Roll Number": "EP19BTECH11020",
			"course": "B.Tech",
			"company": "Servicenow",
			"profile": "Software Development intern",
			"ctc": "70K PM",
			"rounds": "There were a total of 4 rounds. 1st round: This was the online screening test conducted on Hackerrank which consisted of one medium level coding question and MCQs based on data structures, javascript syntax and DBMS. 2nd round: This was the first technical interview round, it started with my brief introduction and I was asked to describe (along with pseudocode) techniques like binary search, sorting and about binary search trees, stacks, queues etc. Questions were asked from my resume about POR, projects and applications of mentioned skills. 3rd round: This was pure coding round. It consisted of 1 SQL query question, 2 medium level (DP and greedy) and 1 hard level DP problem. The interviewer helped me whenever I got stuck and gave hints to optimize my code. I was also asked to explain the time and space complexities of my approach. I couldn't solve the hard one but the interviewer was ok with the thought process. 4th round: The last round focused on a OOP design problem and some behavioral questions.  ",
			"preparation": "Start practicing CP, the earlier the better. Be thorough with DSA. Learn most of the data structures and algorithms that are commonly asked. Also, be thorough with DBMS concepts and SQL. Be well versed with the programming language you are using.   ",
			"tips": "Don't make careless mistakes in online test as some questions may seem too easy, and this lowers your chances of getting shortlisted. Be ready to clearly answer everything written in your resume. Try to have projects. If you don't know the answer, it's always better to say you don't know instead of guessing it. If you are from non-CS branches, it is likely that you will be asked why you are interested in applying for SDE internship. Have a solid reason to answer this and if asked, mention all your work related to the position you are applying for. While solving coding problem, communicate well with interviewer and don't remain silent. Lastly, don't lose hope if you don't get selected. Just be calm and try to perform well in the next one :)  ",
			"experience": "I mostly used leetcode and geeksforgeeks for my preparation. Questions from leetcode are similar to those being asked in interviews. I started preparing after the vacation started. I solved easy level questions first and then gradually moved to medium level and also spent time on hard problems. Reading past interview experiences will give an idea on how to score good in interview rounds. ",
			"branch": "EP"
		},
		{
			"Name": "Sai Ashish Jana ",
			"Roll Number": "EE19BTECH11052",
			"course": "B.Tech",
			"company": "Siemens",
			"profile": "ML role",
			"ctc": null,
			"rounds": "Phone call interview followed by 2 video interviews",
			"preparation": "Concept clarity in projects listed in CV",
			"tips": null,
			"experience": null,
			"branch": "EE"
		},
		{
			"Name": "Samar Garg",
			"Roll Number": "CS19BTECH11033",
			"course": "B.Tech",
			"company": "Sprinklr",
			"profile": "Product Intern",
			"ctc": "2L PM ",
			"rounds": "The number of total rounds is usually 3-4. In my case it was 4 rounds. The first 3 were technical rounds while the last was HR round. Every technical round started with a short intro.\n\nThe FIRST round didn’t involve any code, but rather focused on testing overall aptitude. One of the questions asked was figuring out a winning strategy in a game where 2 players choose numbers successively and the person reaching a particular total wins.  \n\nThe SECOND round involved writing pseudocode for solving both CP and LOGICAL questions. It also tested the knowledge and understanding of Data Structures. The interviewer described a problem and asked what kind of data structure would be best to tackle the problem. To give an example, there was a question on how would you implement a snake game. How would you store the configuration of the snake at any given time.\n\nIn the THIRD round I was asked questions on semaphore and deadlocks. Questions on OS were also asked extensively in the previous rounds.\n\nLast was the HR round, which is pretty much a formality.",
			"preparation": "In total you would need a solid knowledge of OS fundamentals, data structures and basic CP problem solving skills. Also the ability to quickly answer the aptitude questions would help.",
			"tips": "Take your time understanding the problem, you can ask the interview to repeat the question, but don’t start until you are sure you know what is expected.\nAnother thing that is really important is that you are able to properly express whatever you are thinking and intend to do. ",
			"experience": "I practised CP questions on the site InterviewBit. I found it to be pretty systematic and exhaustive for  a good preparation.",
			"branch": "CS"
		},
		{
			"Name": "P Srivardhan",
			"Roll Number": "CS19BTECH11052",
			"course": "B.Tech",
			"company": "Sprinklr",
			"profile": "Product Engineer ",
			"ctc": "2L PM",
			"rounds": "Selection process contained one written test, 2 technical interview rounds and a HR round. The written test consists of 3 coding questions. In my first round of interview, some quick questions about object oriented stuff and then some puzzles and then discussion of resume. Second round involved deep discussion on my resume and some OS questions (parallelism , threads etc...) and some basic DSA questions.",
			"preparation": "Knowledge of DSA and Standard CS concepts are must. Catch the hints in the interviewer's feedback. Having a project is a value addition in the interview. For the HR round understand the what the company does (Listening to PPT is good enough) and how you align to the company and role. ",
			"tips": null,
			"experience": null,
			"branch": "CS"
		},
		{
			"Name": "Praveen kumar K",
			"Roll Number": "me19btech11037",
			"course": "B.Tech",
			"company": "TCS",
			"profile": "Intern",
			"ctc": "50K PM",
			"rounds": "Online interview",
			"preparation": "Be academically strong",
			"tips": null,
			"experience": null,
			"branch": "ME"
		},
		{
			"Name": "Smaran Panth Kulkarni",
			"Roll Number": "EE19BTECH11043",
			"course": "B.Tech",
			"company": "Texas Instruments",
			"profile": "Analog Engineering Intern",
			"ctc": "45K PM",
			"rounds": "There were 2 rounds in total. First round was technical test .Every candidate must attempt mental ability section (20 questions to be solved in 25 minutes ). Additionally every candidates must attempt at least one of the three sections ( Analog, Digital and Communications). Each section has 20 questions which have to be solved in 45 minutes. In analog section questions based on Circuit & Network Analysis, Opamps, Transistors etc. were asked.\n\nAfter we qualify the technical test, we will be promoted to technical interview. I applied only for analog position. So all the questions asked were specific to analog domain. The interview went on for about 40 - 45 minutes. Initially basic questions related to Circuit analysis were asked. As the interview progressed more ",
			"preparation": "Revision of Circuit theory, Analog electronics will help a lot. Refer to videos by YouTube channels like All about Electronics etc. will also help.",
			"tips": "Confidence is the key. It is better to admit anything we don't know during the interview. Try to be as frank as possible.",
			"experience": "I referred to my class notes and various other YouTube pages. ",
			"branch": "EE"
		},
		{
			"Name": "S.Naga Chandra Mouli",
			"Roll Number": "EE19BTECH11016 ",
			"course": "B.Tech",
			"company": "Texas Instruments",
			"profile": "Signal Processing(core)",
			"ctc": "45K PM",
			"rounds": "There were totally 3 rounds happened according to me\n1. Resume shortlist\n2. Aptitude & Technical Test(analog, digital,signal processing)\n3. Technical interview(analog,digital and signal processing)",
			"preparation": "1.RESUME: Basically I am interested in core so i just put some important core projects which i have done in my core courses and revised them thoroughly.\nSo,I would suggest the same to my juniors. \n2.TECHNICAL TEST & APTITUDE:  In JD company provided some topics according to the domains. So i just revised those topics from basics and solved some problems and also gone through some previous competitive papers like gate etc.\nFor aptitude i just practised some mock tests in online.\n3.TECHNICAL INTERVIEW: Panel members started interview from resume itself. They asked me questions about projects that i had mentioned in the resume. I explained everything about project. Then, they started asking basics  questions from the topics mentioned( signals and systems, analog communication techniques, Digital communications, sampling and quantization and Dsp) After the basic questions they increased the level of difficulty and given some problems. They asked me about theoretical back ground in the question and observed how my approach was. When i was getting something then they provided me with some hints and supported me to think. ",
			"tips": "1. For written test I would suggest to go through topics clearly and then solve some mock tests before the test.\n2. For interview first thing being calm and steady is important. And ask them if you need any help. If you are not getting anything don't give up atleast give your approach even that counts too. Be clear with basics.",
			"experience": "Frankly i didn't have any preparation and didn't followed any strategy. Just before one week i started going through the topics. For that i have used class materials of related courses and also followed MIT opencourseware. Some mobile apps for covering basics. And for aptitude and practise i have written some mock tests  of gate and isro. From starting onwards i have been clear with my resume. That's it.  Thank you.",
			"branch": "EE"
		},
		{
			"Name": "Narumugai T",
			"Roll Number": "BD19BDES11004",
			"course": "B.Des",
			"company": "Zomato",
			"profile": "Design intern",
			"ctc": "30K PM",
			"rounds": "Round 1- portfolio round\nRound 2- interview",
			"preparation": "Not really, you need to have a well prepared portfolio specific to the role you are applying for in the design field. The interviews will be relatively easier.",
			"tips": null,
			"experience": null,
			"branch": "BD"
		}
	]
}
