{
	"students": [
		{
			"Name": "Anjana Vasudevan",
			"Roll Number": "AI20MTECH14010",
			"course": "M.Tech 2Y",
			"company": "Accenture (S&C)",
			"profile": "Analyst",
			"rounds": "3 rounds: \nRound 1 - Test on job readiness (question on developing end to end solution for a client problem - no coding involved)\nRound 2 - Technical round (questions on data science, ML and DL fundamentals)\nRound 3 - HR round (questions on individual capabilities and experience)",
			"preparation": "For technical rounds, solid understanding of coursework (if from artificial intelligence) should be more than enough. For analyst roles, prepare some case studies on where ML / DL can be applied.\n\nMost importantly, strong grasp of coding is required.",
			"tips": null,
			"experience": "Resources available on the internet (searching for popular interview questions, coding preparation from leetcode / hackerearth)",
			"branch": "AI"
		},
		{
			"Name": "Aditya kumar singh",
			"Roll Number": "me18btech11002",
			"course": "B.Tech",
			"company": "Amazon",
			"profile": "SDE",
			"rounds": "Rounds were not too difficult anyone with basic skills in programming can pass",
			"preparation": "DSA Only DSA",
			"tips": "Please limit the number of companies a student can get shortlisted in.",
			"experience": "Youtube",
			"branch": "ME"
		},
		{
			"Name": "K R Sai Pranav",
			"Roll Number": "AI20MTECH14013",
			"course": "M.Tech TA",
			"company": "American Express",
			"profile": "Data analyst",
			"rounds": "Aptitude and data analysis round, Technical round, HR round ",
			"preparation": "Prepare for aptitude thoroughly. Technical round questions were based on probability, linear algebra. ",
			"tips": null,
			"experience": null,
			"branch": "AI"
		},
		{
			"Name": "Juguru Kavya Sri",
			"Roll Number": "CE20MTECH11006",
			"course": "M.Tech 2Y",
			"company": "Arup",
			"profile": "Graduate Engineer - Software Development",
			"rounds": "Two technical Interview rounds",
			"preparation": "Problem solving methodologies",
			"tips": null,
			"experience": null,
			"branch": "CE"
		},
		{
			"Name": "Prakash Laxman Varkol",
			"Roll Number": "ME20MTECH11004",
			"course": "M.Tech 2Y",
			"company": "Bajaj Auto",
			"profile": "GET",
			"rounds": "Written test\nTechnical interview\nHR interview",
			"preparation": "Written test - GATE syllabus and aptitude/ reasoning",
			"tips": "Revise your gate syllabus for technical questions and also get good at solving aptitude sums quickly. \nFor the technical interview have good clarity and grip over your project as most of the interview will be focused on your project work. Also prepare the company profile related technical subjects well.\nThe first question will always be \"tell me something about yourself\" so prepare a brief introduction about yourself beforehand and practice it. \n",
			"experience": "GATE notes, Aptitude problems set, YouTube videos to understand some difficult concepts. \nI was always revising GATE concepts but started seriously preparing for placements about 30-45 days before day zero.",
			"branch": "ME"
		},
		{
			"Name": "Srinivas Kalyan",
			"Roll Number": "ME18BTECH11051 ",
			"course": "B.Tech",
			"company": "Bharat Electronics",
			"profile": "Deputy Engineer",
			"rounds": "Single interview of 45mins approx. In the same interview they conduct both technical and HR rounds. A panel of 7-8 members consisting of both HR and technical people. ",
			"preparation": "Learn about the PSU you are trying for, they might ask what they produce. As there is no Pre Placement talk, you are expected to check their website to learn about them. They shortlist based on CGPA, although there is some relaxation for category students. Interview questions were mostly based on basic core knowledge. They ask questions on your project. Try to have atleast 2 good projects. They estimate your skills with your project, so select projects with utmost care. Don't expect Gate level questions in interview. Be thorough with your projects and basic core knowledge, that should be enough. ",
			"tips": null,
			"experience": null,
			"branch": "ME"
		},
		{
			"Name": "Rohan Kaushik",
			"Roll Number": "SM20MTECH12001",
			"course": "M.Tech 2Y",
			"company": "Blend360",
			"profile": "Data Scientist",
			"rounds": "Initial online assessment followed by final technical and HR interviews",
			"preparation": "Online assessment tested Data structure (mainly Python) skills along with knowledge of Data Scientist relevant tools. Technical interview involved questions on ML, SQL, Pandas etc.",
			"tips": null,
			"experience": "Started preparing from July 2021. Studied Data Structure from an Udemy course, did 50 Data Structure questions on Leetcode along with around 150 questions on InterviewBits. Revised my ML/AI from the notes and content material of FOML and Deep Learning courses taken within IITH. Practised SQL from W3schools website.",
			"branch": "SM"
		},
		{
			"Name": "Priya Bhatia",
			"Roll Number": "AI20MTECH14015",
			"course": "M.Tech 2Y",
			"company": "Blend360",
			"profile": "Data Scientist",
			"rounds": "Rounds are tentative and varies from student to student. For me, only one round happened and I got selected.",
			"preparation": "It completely depends on what company you are applying but as a broader sense if you are applying for Data Science or SDE roles, knowledge of Data Structure and Algorithms is must in order to crack the coding round followed by expertise in the domain knowledge would be of great help.",
			"tips": "Be confident, try to focus on edge cases while writing the code, only writing code is not sufficient you must be able to clearly explain the interviewer about your logic.",
			"experience": "Leetcode for coding practice\nAce the Data Science Interviews Book\nKrish Naik, Statquest YouTube videos for references\nAnd various text books if needed.",
			"branch": "AI"
		},
		{
			"Name": "Adishwar sonapally",
			"Roll Number": "Ce18btech11030 ",
			"course": "B.Tech",
			"company": "Brane Enterprises",
			"profile": "Associate solution leader",
			"rounds": "1 written test\n3 technical inerviews",
			"preparation": "Written test: analytical and logical \n1st interview: basic coding \n2nd interview: data structures\n3rd interview: basic coding",
			"tips": null,
			"experience": null,
			"branch": "CE"
		},
		{
			"Name": "E.V.S. Himeswi Reddy",
			"Roll Number": "CE18BTECH11012",
			"course": "B.Tech",
			"company": "BYJU'S",
			"profile": "Content developer",
			"rounds": "Hi",
			"preparation": "be confident",
			"tips": null,
			"experience": null,
			"branch": "CE"
		},
		{
			"Name": "Kusum Kumari",
			"Roll Number": "CY20MSCST11017",
			"course": "M.Sc",
			"company": "BYJU'S",
			"profile": "Faculty position byjus",
			"rounds": "1)CV shortlist 2)Interview",
			"preparation": "Just be confident",
			"tips": null,
			"experience": null,
			"branch": "CY"
		},
		{
			"Name": "JAYKISHAN PIPALIYA",
			"Roll Number": "cs20mtech11012",
			"course": "M.Tech 2Y",
			"company": "Ceremorphic",
			"profile": "Software",
			"rounds": "1. First Round was coding and technical questions. Technical questions was based on ML, C language, DSA.\n2. Second round was technical interview, in which they mainly asked the DSA questions basic to medium level. And few questions on OS and OOPS concepts.\n3. Third round was again technical interview, in which they asked questions based on my resume and projects. ",
			"preparation": "1. Focus on DSA concepts\n2. Competitive programing on leetcode, gfg, gfg standard questions\n3. Revise the OS, OOPS concepts",
			"tips": null,
			"experience": null,
			"branch": "CS"
		},
		{
			"Name": "Reetika Banerjee",
			"Roll Number": "ee20mtech14018",
			"course": "M.Tech 2Y",
			"company": "Ceremorphic",
			"profile": "Analog Design Engineer",
			"rounds": "3 rounds (2 technical,1 Hr)",
			"preparation": "Analog IC design,Analog circuits,Thesis",
			"tips": null,
			"experience": "Youtube videos",
			"branch": "EE"
		},
		{
			"Name": "Kulkarni Shridhar Sandip ",
			"Roll Number": "CE18BTECH11019",
			"course": "B.Tech",
			"company": "Cogoport",
			"profile": "Associate Software Engineer",
			"rounds": "Aptitude/Coding Round , Interview. Or Walk in interview",
			"preparation": "Programming for first round and interview preparation kits for further interview rounds ",
			"tips": null,
			"experience": null,
			"branch": "CE"
		},
		{
			"Name": "Harshad Ashok Bhosale",
			"Roll Number": "ce18btech11014",
			"course": "B.Tech",
			"company": "Cogoport",
			"profile": "Associate Software Engineer",
			"rounds": "Online Test, Technical and HR interview.",
			"preparation": "Online Test - Proficiency in at least one language(c++, java, python), DSA and problem solving\nTechnical interview - DSA, problem solving, communication skills.\nHR interview - communication skills, motivation.",
			"tips": "Practice problem solving on websites and also take part in challenges to get rankings and getting comparison estimates for performance.\nSome common questions are always asked be prepared not memorized for them. Also build your resume properly and be ready to backup with any question that can be asked from it.",
			"experience": "YouTube (Python, sql)\nOnline learning/problem practice website (geeksforgeeks, hackerearth, hackerrank)\nbooks (mostly not required but still good to start: Let us C by yashwant kanetkar)\nI started learning coding from my 2nd year but learnt by doing/practice from 3rd year.\nChallenges: No proper guide from start to end but geeksforgeeks was a 90% match, Real time interview solving problem and coding is completely different scenario and requires good communication skills but before that understanding of solving problem.",
			"branch": "CE"
		},
		{
			"Name": "Swapnil Vaidya",
			"Roll Number": "ce18btech11031",
			"course": "B.Tech",
			"company": "Cogoport",
			"profile": "associate software engineer",
			"rounds": "Round 1 it was an online test on their platform . Three question asked, all of them from geeks for geeks i was able to solve all the question.\nRound 2 interview on google meet started with the introduction then he asked approach about one of the question from online test. It was sliding window question.I am able to explain the answer and told my approach. Then he asked if i did any project so then I shared the one fullstack project link which was made using html css php and mysql live on server. \nno further round i was selected in 2nd round itself",
			"preparation": "keep it simple dont complicate things if you dont know the answer tell them you dont know ask for some hints but dont give any answer that your not confident",
			"tips": "strong your skills whatever you have. have deep understanding about your project",
			"experience": "I started my preparation seriously in august month but I had the  basic understanding about html css and coding .I prefer gfg aditya verma and code with harry .",
			"branch": "CE"
		},
		{
			"Name": "P.N. SAI SHARAN",
			"Roll Number": "ES18BTECH11005",
			"course": "B.Tech",
			"company": "Deloitte",
			"profile": "USI - CONSULTING",
			"rounds": "aptitude, 1st round interview, HR round interview",
			"preparation": "Gone with the flow was preparing for many companies finally got selected in one.",
			"tips": "Make sure basics are strong and most important thing don't panic in the interview round.",
			"experience": "Mostly the famous coding platforms and some aptitude preparation.",
			"branch": "ES"
		},
		{
			"Name": "Sandeep V",
			"Roll Number": "Me18btech11047",
			"course": "B.Tech",
			"company": "Denso",
			"profile": "NAD",
			"rounds": "We started off with the logical reasoning and coding test which was held online as round 1 of selections. Then the selected candidates were interviewed about their respected roles and tested our knowledge. My interview experience was positive, they didn't go deep in the subject knowledge but just tested our basics. Simultaneously we had a personal interview too. Then the selected candidates were set to go to the 3 rd round, HR interview. Where it's more like confirming already selected candidates. This was a fun interview where we just had good friendly conversation with the HR, the main motto of this interview was to confirm whether the candidate will be able to survive in Japan ( Company's location) and merge into their team without any friction. ",
			"preparation": "Only round we need to prepare was for Round 2 where we need to understand the role offered properly and have basic knowledge regarding the same. And the rest of the rounds were nothing new like aptitude, logical reasoning, elementary coding.",
			"tips": "Firstly, know the role offered properly and then the company and their vision. Acquire some basic knowledgeable required for the role ( or review them if \nyou already have). I personally also suggest to be ready with few answers for some common HR interview questions.",
			"experience": "After seeing the job description, I knew what I need to look for. My main resource was internet ( obviously). Though I had basic knowledge regarding it, I had to brush it up and learn more. Main challenges I faced was lack of many resources about few of my topics, but I have learnt what I had and was confident enough that it was sufficient.",
			"branch": "ME"
		},
		{
			"Name": "Prashanth Vaidya",
			"Roll Number": "CS20MTECH14001",
			"course": "M.Tech 2Y",
			"company": "DP World",
			"profile": "Software Development Engineer",
			"rounds": "Coding round— 2 coding rounds. Need to solve both fully to get shortlisted for the next round. \n\nTechnical Round 1 (60 mins)— I was asked to solve 2 Leetcode Medium level questions. One was based on Dynamic Programming and the other one was based on Trees. The interview concluded once my code passed all the test cases for both the questions. \n\nTechnical Round 2 (60 mins)— I was asked to solve 2 Leetcode Hard level questions. One was similar to \"Word Search II\" on Leetcode and it involved using the Trie data structure. The other one was a pretty hard Array question. I was asked to write a full working code for both the questions.This interview was a race against time.  ",
			"preparation": "Start with Leetcode easy problems. Once you are comfortable with them, move on to Leetcode Medium problems. Only when you are fully confident with medium ones, move on to Leetcode hard problems. \n\nCover enough ground and explore all the areas in DSA. Don't blindly run behind metrics like number of problems solved. Don't try to memorise the solutions, instead work on training yourself to solve a completely new problem when you encounter it. \n\nStarting your preparation early helps big time. Just keep solving problems on a daily basis and try to make sure your problem solving skills are sharp before the interview stage. \n\nAlso, practice writing code on paper and explaining your thought process to the interviewer in the month of November. Even if you're unable to solve the problem in the first go, try to explain your current thought process and slowly try to build a working logic using some cues (direct/ indirect) from the interviewer. Avoid long duration of silence in the interview. Communicating your thought process is as important as your problem solving skill. \n\nDon't compare yourself with anyone, stay cool and focus on your own process throughout the placement season. Best of luck! ",
			"tips": null,
			"experience": null,
			"branch": "CS"
		},
		{
			"Name": "KRISHNA MOHAN SHARMA ",
			"Roll Number": "EE20MTECH14023 ",
			"course": "M.Tech 2Y",
			"company": "Eaton",
			"profile": "ETLP(EATON TECHNOLOGICAL LEADERSHIP PROGRAM)",
			"rounds": "Three rounds werw there, each round of about 1 hour. 1st round was Technical, 2nd was Managerial, 3rd HR",
			"preparation": "For technical round- All concepts of Power electronics and power system with major focus on Mtech subjects",
			"tips": "Refer above",
			"experience": null,
			"branch": "EE"
		},
		{
			"Name": "Vrishabh Randive",
			"Roll Number": "ee19mtech01011",
			"course": "M.Tech 3Y RA",
			"company": "Eaton",
			"profile": "Engineer",
			"rounds": "2 Technical round + 1 HR round",
			"preparation": "All about project and course curriculum",
			"tips": "Stick to basics and in depth knowledge about your project ",
			"experience": "Research papers",
			"branch": "EE"
		},
		{
			"Name": "Abin S",
			"Roll Number": "BM20MTECH11005",
			"course": "M.Tech 2Y",
			"company": "Eaton",
			"profile": "Engineer",
			"rounds": "Technical Interview - Asked technical questions , there were two rounds but I got directly sent to HR round after the first technical round.\n\nHR round - Asked about skills, checked communication skills and other personality traits.\n\n ",
			"preparation": "You need to be ready with some \"all interview\" questions like : tell us about yourself, your weakness , the worst moment in your life , hobbies etc . \n\nYou need to be well reversed and ready to answer in a clear way about the concepts like Object oriented programming, classes ,etc if you are applying for a software role. \n\nThis is applicable to not only software roles, there are some questions which we are sure we will encounter in the technical interview process, so be ready with it thoroughly. \n",
			"tips": "You need to be thorough with data structures and algorithms if you are applying for software role. ",
			"experience": "For data structures and algorithm : Geeks for Geeks, algoexpert, \ncoding practice: Hackerrank ",
			"branch": "BM"
		},
		{
			"Name": "BASUDE HARISH KUMAR ",
			"Roll Number": "EE20MTECH11003",
			"course": "M.Tech 2Y",
			"company": "Eaton",
			"profile": "Engineer",
			"rounds": "2 Technical and 1 HR",
			"preparation": "Mtech Thesis and technical subjects ",
			"tips": null,
			"experience": null,
			"branch": "EE"
		},
		{
			"Name": "Rohit Reddy K ",
			"Roll Number": "ES18BTECH11010",
			"course": "B.Tech",
			"company": "Flipkart",
			"profile": "SDE-1",
			"rounds": "1st round- Online test:\n3 questions:\n -One question was based on binary trees.\n- Another question was a tricky one . We were given 2 array and asked to check if something was possible. Ihad 2 solutions. One was very easy, could be done in 10 lines. Another solution we needed to use priority queue.\n- there was one more question. I solved all of them\n\n2nd round - Technical round:\n- First question: in a matrix sorted row-wise and column-wise, efficiently search for a given number. I was able to give a solution but it was not most efficient\n- Second question: how to find out if a given number is a power of 4. I answer in under 5 min. Because of that, there was time for another question\n- Third question: given an array find out something (don't remember). I had to use priority queue and pair along with a sort to get the solution. I was given a hint to solve this.\n\n3rd round - HR round:\n- introduction, talked about hobbies\n- projects, any 2\n- Why do you want to work at Flipkart ",
			"preparation": "For the first 2 rounds, practise competitive coding. This is most important to qualify for interview and further rounds. Practice the questions in the trees, Dynamic programming particularly and the concepts of previous Flipkart questions. \n\nThere might be another technical in which your coding knowledge like OOPS, DBMS, OS are tested. Be thorough in your concepts.\n\nFor HR round: Prepare a good introduction.\nMake sure you know everything written in your CV from projects to extracurriculars. Practice answers for general questions like why this company, where do you see yourself in 5 years etc.",
			"tips": "Written round, keep practicing competitive code. Write atleast a 10 line code daily. \nAfter you learn a concept, practice problems on it.\nIn interviews, be confident. Interviewer will help you if get stuck. Ask them for a hint if you are taking too long for one question. Speaking your thoughts out will let the interviewer your process",
			"experience": "I read the concepts from geeksforgeeks. They also had many practice problems. \nI practiced online on codechef, leetcode. I first started competitive programming for internships. Then I left it after getting an intern. \nFor placements I started practicing in Summer. I had some coding in my summer intern. \n\nInitially I was not shortlisted for many companies. Only a month after the tests began I started getting shortlisted. It was disheartening many times. Even by the end I was not shortlisted in too many companies. But as a result I had more time to focus on each of the companies I got shortlisted for. \nImportant : Do not worry because someone else  is being shortlisted/placed. Just give your best effort",
			"branch": "ES"
		},
		{
			"Name": "Ritesh Parmar",
			"Roll Number": "ma18btech11009",
			"course": "B.Tech",
			"company": "Flipkart",
			"profile": "SDE-I",
			"rounds": "In first round,they conducted an online coding test.there were two questions.then an online personal interview round.this round was totally based on data structure and algorithm in which she asked me two questions-\n1.  https://leetcode.com/problems/decode-ways/\n2. https://www.youtube.com/watch?v=1LkOrc-Le-Y&t=1466s\nthen 3rd round was hiring manager round in which she asked me question related to my resume. ",
			"preparation": "Only Data structre and Algorithm needed.",
			"tips": "try to solve each and every coding question.take an experience of each coding platform.",
			"experience": "gfg,Youtube,Leetcode,Hackerrank.",
			"branch": "MA"
		},
		{
			"Name": "Sakshi Varshney ",
			"Roll Number": "CS16resch01002",
			"course": "PhD",
			"company": "Fujitsu",
			"profile": "Research scientist ",
			"rounds": "Technical round, HR round",
			"preparation": "Get an overview of research area, if possible make an overview ppt",
			"tips": "Written was not there",
			"experience": "Research area",
			"branch": "CS"
		},
		{
			"Name": "Shivangi Parashar",
			"Roll Number": "AI20MTECH14012",
			"course": "M.Tech 2Y",
			"company": "Gojek",
			"profile": "Software Development Engineer",
			"rounds": "Round 1:Online coding test\nThis test was conducted on Hacker rank platform and the duration of the test was 45 minutes.\nTest consisted of 2 coding questions of medium level difficulty alongwith 11  MCQS to test your technical aptitude.\nRound-1 Criteria:\nTop-performing candidates (in IITH's case - 24) from the test were selected. There was no other criterion used.\n\nRound 2:Machine coding round\nThe test was conducted on HackerRank platform and the duration of the test was 60 minutes.\nIn this round we were asked to implement a banking application .All the instructions for the game were clearly mentioned in the question.\nTips:.\n1. Code should follow SOLID OOPS  principles.\n2. Solutions with unit tests will be given more priority. (Add if possible, it's not mandatory)\n3. Use Git (or other version control tools) to make frequent commits. (Add if possible).\n4. Follow good coding practices and principles (These carry weightage in the review)\n\nRound-2 Criteria:\nThey had a set benchmark. According to the scores returned by the testing platform, whoever achieved the benchmark was shortlisted.\n\nFace to Face interview(Day 0)\nRound -3:Code pairing Round\nRound -4:Technical Interview",
			"preparation": "Proper understanding of OOPS principles,CS fundamental knowledge, data structures",
			"tips": "Be crystal clear with your data structure concepts",
			"experience": "Leet code, Geeks for Geeks.Start slowly and make your concepts clear.The college and Internship projects which you do should be real projects and not copied from github so when you talk about them ,they sounded real as the work on them is still going on and you could talk about their extravagance.\n",
			"branch": "AI"
		},
		{
			"Name": "Aditya Singh ",
			"Roll Number": "CS18BTECH11048 ",
			"course": "B.Tech",
			"company": "Google",
			"profile": "Software Engineer ",
			"rounds": "First there was a online coding round conducted on hackerearth. It consisted of 2 questions to be done in 60 minutes. I felt they were on the difficult side. The shortlist for this round was not completely based on the coding round, they had taken resume and branch into consideration as well. I myself was not able to do even question and had lost any hope of getting shortlisted for further rounds.\n\nSecond round was video interview. There were 3 interview rounds. Each consisting of around 15 minutes of \"Googliness\" and 45 minutes of DSA based problem solving. Googliness questions were mostly required drawing from your past experiences to answer some leadership and personality questions. The Coding questions asked were from the topics like Graph, Trees, DP and Array manipulation. It is advisable to discuss the approach before jumping to coding. One should also try to think out loud while coding. Try to keep up the speed as usually the interviewers expect you to answer two coding problems -- either 2 different or 1 question and its followup.\nI was able to all the questions asked, required some hints in the final round, which they are generally generous about.",
			"preparation": "Fir the online coding round doing CP questions from websites like codechef and codeforces will be helpful. \n\nFor the interview round they themselves informed in a prep meet held 3 days before the interview that they won't be asking anything other than DSA. So just prepare Graph, Trees, Trie and DP very well.",
			"tips": "Be confident and never lose hope. Always try to be positive.",
			"experience": "I mostly used leetcode. I used to do topic wise questions to get acquainted with a specific topic. I also used to do the leetcode weekly and biweekly challenges. Leetcode discussion also has a good amount of Online Assessment (OA) coding questions of different companies. Close to the interviews I starred reading up the interview experiences of the companies on GeeksForGeeks.",
			"branch": "CS"
		},
		{
			"Name": "shantanu das",
			"Roll Number": "me20mtech14012",
			"course": "M.Tech 2Y",
			"company": "HCL",
			"profile": "SENIOR SOFTWARE ENGINEER",
			"rounds": "1.Online Test: It consisted 4 sections- coding , quantitative aptitude, logical reasoning, Verbal ability.\nCoding section had 2 questions. One based on array another was based on string.\nDifficulty Level as per GFG : Easy\nDifficulty for other sections[quantitative aptitude, logical reasoning, Verbal ability]- Average\n\n2. Technical Interview:  I was asked to explain the projects what were mentioned in my resume in details followed by some cross questions.\n\n3.HR Interview: HR Interview was for formality sake. I was asked  about my academic details so far in my career .Why HCL, My Strength & weaknesses and some other typical HR questions were asked.\n\n\n",
			"preparation": "For coding part practicing questions from gfg or leetcode of easy, medium level would suffice.   For noncoding part practicing questions from indiabix would help.",
			"tips": null,
			"experience": null,
			"branch": "ME"
		},
		{
			"Name": "D V K M Rishab",
			"Roll Number": "AI20MTECH14004",
			"course": "M.Tech 2Y",
			"company": "HCL",
			"profile": "Senior Software Engineer - TFG and Analytics",
			"rounds": "1st Round - Exam consisting of Aptitude, Technical and Coding Questions\n2nd Round - Technical and HR Interview",
			"preparation": "For the Exam, be thorough with the Basics of Aptitude, Computer Science and Basic Programming Questions. For the Interview, be thorough with everything you have entered in your Resume like Projects, Internships, Skills etc. and also be thorough with the Frequently asked CS Interview and HR Interview Questions",
			"tips": null,
			"experience": null,
			"branch": "AI"
		},
		{
			"Name": "Shubham Patel ",
			"Roll Number": "NS20MTECH11004",
			"course": "M.Tech 2Y",
			"company": "Head Digital Works",
			"profile": "SDE-1",
			"rounds": "Only 1 round. In that round, first I had technical & then HR.",
			"preparation": "Coding DSA.\nDo a good project.\nBe thorough with the programming basics.",
			"tips": null,
			"experience": "Do aptitude.\nDo English.\nDo code DSA.\nI practiced from an aptitude book.\nI did coding on leetcode.",
			"branch": "NS"
		},
		{
			"Name": "Vaibhav Gaydhane",
			"Roll Number": "AI20MTECH11002",
			"course": "M.Tech 2Y",
			"company": "Honeywell",
			"profile": "Machine Learning (R&D Engineer)",
			"rounds": "Round 1. Coding Written Test\nRound 2. Technical Interview\nRound 3. HR Round",
			"preparation": "Round 1. Data Structures and Algorithm, coding\nRound 2. ML, deep learning, Thesis, projects\nRound 3. Basic HR questions, ques about company",
			"tips": null,
			"experience": null,
			"branch": "AI"
		},
		{
			"Name": "Mahima Nareshchandra Dahekar",
			"Roll Number": "md20mdes14031",
			"course": "M.Des",
			"company": "I'm Beside You",
			"profile": "User interface and experience Designer",
			"rounds": "I had applied for an internship at the company through tech-japan. I was sent a list of questions and was asked to make a self-intro video with answers to the questions sent. I had interned with the company for two months. Based on my progress during the Internship I was offered a PPO.",
			"preparation": "Do a prior research on the company and answer to their questions accordingly.\nPresent creativity in your video/interview.",
			"tips": null,
			"experience": null,
			"branch": "MD"
		},
		{
			"Name": "Athkuri Sai Saketha Chandra",
			"Roll Number": "me14m16p000002",
			"course": "PhD",
			"company": "INSOFE",
			"profile": "Post doctoral fellow ",
			"rounds": "1. online test\n2. Presentation\n3. HR round",
			"preparation": "Communication skills",
			"tips": "Good presentation skills",
			"experience": null,
			"branch": "ME"
		},
		{
			"Name": "surendra",
			"Roll Number": "ch20mtech11006",
			"course": "M.Tech 2Y",
			"company": "IQVIA",
			"profile": "Data analyst",
			"rounds": "aptitude, HR, technical",
			"preparation": "practice of apti and english from standard sources (indiabix and rd sharma)\ncase studies and puzzles (youtube, geeksforgeeks, indiabix)",
			"tips": "Prior practice and rehearsal of interview process with friends/self. online virtual environment for interview is offered by some edtechs.\n\nTry to be unique and clear with the answers (even for the simple qstns like intro, strengths, weakness etc). \n\nrelevant Research about the job profile and the company. ",
			"experience": "Intially Waited for core companies, as the situation in core was not very favorable, started preparing for analytics/non-core in the month of november-2021. \n\nIts tedious and hectic to manage all the tasks in final year. So be prepared before the placement season, if planning to shift your career path ( to software or consulting)  \n\n mostly relied on Youtube and Geeksforgeeks. self evaluation and consistency is must.",
			"branch": "CH"
		},
		{
			"Name": "Mohammed Sadiq",
			"Roll Number": "EE18BTECH11051",
			"course": "B.Tech",
			"company": "Indeed",
			"profile": "SDE",
			"rounds": "A coding round was conducted for shortlisting. Only Computer Science and any CS Double Major students were allowed to take the test. It was a 50 minute test with 2 coding questions.\n\nThere were 4 rounds of interviews. 3 technical rounds of 1 hr each and 1 HR of 30 minutes.\nAll technical rounds were similar in structure where a simple problem problem statement was given and we were asked to design code for it. Then, interviewers keep adding more complexity to the existing problem and we need to modify our code.\nInterviewers also tested my understanding of the time and space complexities of the code.\n",
			"preparation": "The most important skill companies look for is Algorithms, OOPS and data structures. Interviewers focus more on Internships and projects in later rounds, but as long as the student has good problem solving skills, it is easy to perform good in interviews. Some companies also ask questions related to DBMS and OS.",
			"tips": null,
			"experience": "I started my preparation about 3 months before the placement interviews.\n\nFirst get good with OOPS in your preferred language. C++ or Java are the best for Competitive Programming.\nIf you're using C++ as I did, then get comfortable with STL library data structures.\n\nSlove all most common problems for each data structure. The order I followed was from the site interviewbit. GeeksforGeeks also has a good collection of most commonly asked interview questions.\n\nOnce a good enough understanding of different DS and Algorithms is reached, start solving questions from leetcode or codeforces. This should be enough to perform well in most interviews.",
			"branch": "EE"
		},
		{
			"Name": "Sharan Narasimhan",
			"Roll Number": "cs20mtech14003",
			"course": "M.Tech 2Y",
			"company": "Indeed",
			"profile": "Data Engineer",
			"rounds": "My experience can be found here: https://www.geeksforgeeks.org/indeed-interview-experience-for-data-engineer-on-campus-2022/",
			"preparation": "I wrote my tips here: https://medium.com/p/b253ef7f43ca",
			"tips": null,
			"experience": null,
			"branch": "CS"
		},
		{
			"Name": "Bhargav Siva Phaneendra Annavarapu",
			"Roll Number": "CS18BTECH11005",
			"course": "B.Tech",
			"company": "Infurnia",
			"profile": "SDE",
			"rounds": "1 Written Test + 3 Interview Rounds\n\nWritten Test:\nWritten Test was an aptitude test and had no coding questions.\nTest duration : 90min\nTest consists of 3 sections, each section has 15MCQ\nEach question carries 3 marks and there is also -ve marking(-1)\nYou cant revisit the questions\n\nInterview 1:\nInterview was for 30 min\nQuestions were focused on mathematical puzzles and system design.\nQuestions - \n1. Explain about any project of your choice.\n2. All the points in the coordinate plane are colored either red or blue. Show that for any given distance 'r' there exists 2 points such that they have the same color.\n3. This is a system design question with multiple parts.\nYou have a rendering service(Basically a CPU intensive task) and a couple of servers, how to make sure all the rendering requests are served.\nIdentify the points of failure\nHow would you remedy them\nHow would you know when a server has completed its request\n\nInterview 2:\nI was directly called for Interview 3\n\nInterview 3:\nThis was just a formality interview. It was only 10-15min\nQuestions -\n1. You are given a polygon(Could be convex or concave) and a point, you have to determine if the point is inside or outside the polygon.\n2. 2 players are playing a game of cards. they both each draw a card and if both the cards are red, player 1 gets them, if both are black then player 2 gets them else the cards are discarded. Player 1 wins if he has more cards than player 2 by end of the game. What is the probability that player 1 wins (answer is not 50%)",
			"preparation": "For aptitude you can find many sample papers online which you can use for practice.\nI watched videos on Gaurav Sen youtube channel for system design.",
			"tips": "Practice Mock interviews with your friends before attending the actual interview.\nAlways start with a brute-force approach in the interview and build up the solution.\nProvide examples and dry run your code\n\nPractice DSA. Make sure to cover all the topics.\nAfter the written test discuss the solutions with your friends as some question repeat for other exams\n",
			"experience": "Study Material : \nCSES Problem set\nTake U Forward SDE sheet\nCompany wise Question from GFG\nThese helped me the most.\nI also use Leetcode, Interviewbit and Hackerrank sometimes.\nParticipate in Codeforces contests to see how much progress you make and how fast you're able to solve the problems.",
			"branch": "CS"
		},
		{
			"Name": "Venkata Sathwik Reddy G",
			"Roll Number": "CS18BTECH11014",
			"course": "B.Tech",
			"company": "Infurnia",
			"profile": "Software Development Engineer",
			"rounds": "The process had 4 rounds in total(Resume shortlisting + 3 interviews). \n\nInterview 1(45 minutes to 1 hr): This round was mostly based on my resume and a few high level design questions. First I was asked why I used a specific technology in one of my projects. Then one of the panelists asked a basic math question to which I gave my explanation. After that, they gave me a situation and asked me to point out what needs to be solved to make the system reliable. After some discussion, I arrived at what they were expecting from me. Later, the other panelist was looking at my resume and started asking questions on DBMS(because I mentioned my DBMS project on my resume). He asked me some basic questions like what is RDBMS, Normalisation, types of Normalisation.This was followed by some basic data structure questions. Then they started asking questions on OOPs(which I mentioned on my resume). Starting with the definition of virtual function, they went on giving me situations and asked how I would use OOP in those situations. They seemed satisfied with my answers.\n\nInterview 2(45 minutes to 1 hr): This round was mostly based on puzzles and system design. First the panelists asked me to pick one project from my resume and explain it to them. Then they shared a google doc and started pasting questions. The first question was related to probability and a follow up question on the same. Then they asked me two puzzle like questions. That was followed by a system design question with multiple modifications within the question(stuff like what data structures to use, design decisions, how to make the system fault tolerant, etc). \n\nInterview 3(15 minutes): This interview is not technical. The panelists asked me some casual questions and explained about the job role. Later, they answered some of my questions and the offer letter was sent immediately after this interview.",
			"preparation": "Knowledge of Data Structures and Algorithms is essential. Try to be good at atleast one object-oriented programming language(mine was C++). Also, you should be able to explain your projects and answer all the related questions. Try to get an idea of what system design is and practice some basic questions so that you won't get panicked when the interviewer asks a design question.",
			"tips": "Try to get shortlisted in as many companies as possible. Make sure that you can answer any question based on your resume. It's better to omit stuff from your resume which you are not confident about. Don't be calm during the interviews, make sure the interviewer understands your thought process. You don't have to reach the final answer for every question. ",
			"experience": "I started doing leetcode much ahead of the placement season. It really helps if you practice topic wise questions like arrays, linked list, trees, graphs etc. For the Computer science concepts, I used my course slides and geeksforgeeks website.",
			"branch": "CS"
		},
		{
			"Name": "Akash Tadwai",
			"Roll Number": "ES18BTECH11019",
			"course": "B.Tech",
			"company": "JP Morgan Chase",
			"profile": "Quantitative Researcher",
			"rounds": "The whole process consisted of 4 rounds.\n\nRound 1(Online Assessment Test): They held an online test on cocubes platform in which there were 2 Papers, First paper consisted of 3 sections that had MCQs and the Second paper consisted of one coding section. \n\nIn the first paper, the first section consisted of math questions (5) and they were of moderate level. The second section consisted of Probability and Counting questions – medium-hard (14). The third section consisted of Data structure and Algorithm MCQs – Easy (11). The second paper consisted of 2 Coding questions (Easy-medium).  \nThey shortlisted around 30 students for the interviews.\nRound 2(Interview 1 – 1hr 10mins): This round mostly tested my C++ and Math skills.  \n\nThe interviewer asked me in which language do I code and I answered C++. \nHe asked about OOP in C++. \nHe started with basics and moved on to the more complex ones. \nHe asked about Encapsulation, Abstraction, asked me to explain Polymorphism with a real-world example and how internally run time polymorphism works (vtables and vpointers). \nHe then asked about the Multiple Inheritance and Diamond Problem.  \nHe asked about why do we need a Copy constructor and can It be private. \nHe then moved on to the differences between shallow copy and deep copy and what does the copy constructor does. He then asked me whether I know any design patterns and I answered yes and I named singleton and factory. \nHe asked deeply about singleton when and where do we use it and an example of it where it is used. \nHe then asked me a probability question: Find the expected value of the number of coin tosses to get 2 consecutive heads i.e, “HH”. (https://www.geeksforgeeks.org/expected-number-of-coin-flips-to-get-two-heads-in-a-row/). I wrote the recurrence relation and he was satisfied. \n\nHe then moved on to the Coding question, he asked me to code to detect whether there is a cycle in a) directed graph and b) undirected graph. He asked me if I have any questions. I asked about the work-life at JPMC and how the current team is going to be. (Be prepared with some nice questions beforehand) . I answered all the questions and I got the call for the next round.\n\nRound 3(Interview 2 – 45 mins): This round is mostly tested my Coding and Probability skills. He started with probability puzzles.\n\nIf I flip a fair coin 10 times, what’s the expected number of “HH” observed.  For this, I was trying to write a recurrence as well, but I couldn’t exactly get it. He then gave a clue of defining a random variable X_i if both the ith and (i+1)th toss are heads and then apply the Linearity of expectation to it. I picked up on the clue and solved it. Later I found the same question being on stackexchange (https://math.stackexchange.com/questions/1940118/expected-number-of-hh-in-10-coin-flips).\n\nWhat is the probability that n points lie on the same side of the semi-circle. This is a very standard question which I saw before and hence answered it. \nHe then moved on to coding questions which were pretty standard ones,\n\n1. https://www.geeksforgeeks.org/minimum-time-required-so-that-all-oranges-become-rotten/ \n2. Detect Cycle in a graph \nI answered all the above questions and then the interviewer asked if I had any questions. I asked him regarding the work at JPMC and how different JPMC is doing compared to GS and other investment banks. It’s always good if you make the interviewer that you are keen on working with the company and wanted to know more about it.\n\nRound 4(HR Round – 15mins): This is a general HR round where she asked why I was interested in working at JPMC. \nWhere do I live? \nAm I willing to relocate etc.\nAll the rounds went well and JPMC hired 3 students from our college.",
			"preparation": "Nothing can get you up to interview rounds for any software companies except competitive programming.For a SDE role or even Data Scientist (preliminary rounds), mostly all of them would be tested on your problem-solving and logical skills. It’s good to do other things too but doing CP regularly helps a lot. For the interview rounds, be confident and communicate effectively with the interviewer regarding your thought process. Don’t lie in the interview as the interview may go in a very different way. If you are not comfortable with any concepts tell straight away that you are not aware of it. Interviews will be focussed on OOP, OS,Networks and System Design. For System design see Gaurav sen's videos and educative.io grokking the system design interview course. I was giving Atcoder and Codeforces contests which helped me a lot in terms of my speed. Give contests regularly and upsolve them. I used to do some standard questions from interviewbit which I would say that more aligned towards some specific standard algorithms. I recommend giving short contests from the very beginning so that you will be habituated for the time constraints. Again nothing can take you far except CP. Do practice Aptitude and Probability. I was not shortlisted in some of them because of attempting them badly. For investment banking companies like JPMC and GS,  quant is rigorously tested so don't take it for granted.\n",
			"tips": "Do practice Quant, Probability, and puzzles as they play a very important role in interviews in many companies. There are many resources out there, I followed \n1. Heard on Street\n2. Practical Guide to Quant Finance(https://usermanual.wiki/Document/Practical20Guide20To20Quantitative20Finance20Interview.604244935.pdf)\n\nDon’t lose your hope if not selected in your dream companies. I lost my whole confidence when I didn’t get selected for Google and Razorpay even though I answered all the questions in the online rounds. The thing with interviews is they are hugely dependent on LUCK. It highly depends on the interviewer and questions too. So being panic, and talking about other easy interviews with your friends, just makes you feel more demotivated. Don't at all take aptitude for granted. In my case I got an offline interview offer from Trilogy Innovations (Codenation) , I passed all the 5 interview rounds and online test but I didn't got the required score for the last proctored CCAT (https://www.criteriacorp.com/assessments/cognitive-aptitude/criteria-cognitive-aptitude-test-ccat) test due to which the offer was halted. It felt so bad as after even passing Online Test and 5 interviews just because of the CCAT test the offer is been halted.\n\nOn the day of the interview be calm as you will be interviewing many companies immediately, don’t lose your patience.\n",
			"experience": "I was doing CSES and Codeforces questions as most of the first round questions will be purely logical and not standard algorithmic questions. It helps a lot to look after some standard design questions. The biggest challenge I faced was with Dynamic programming and math questions. I referred to a lot of questions but couldn’t solve them at the moment. Just practice makes things perfect. So do practice a lot.",
			"branch": "ES"
		},
		{
			"Name": "Abhijeet Gunjal",
			"Roll Number": "ME18BTECH11001",
			"course": "B.Tech",
			"company": "Jaguar Land Rover",
			"profile": "Graduate Trainee",
			"rounds": "Walk in Interview placement (2 rounds of interview)",
			"preparation": "Have confidence and knowledge of all your skills and projects for interviews.\nFor CP rounds, practice as much as you can.",
			"tips": "Be open and confident in interviews and don't waste time.",
			"experience": "No material used. \nTook help from a few online CP platforms for CP practice.",
			"branch": "ME"
		},
		{
			"Name": "Arupula Bhavika",
			"Roll Number": "ce18btech11002",
			"course": "B.Tech",
			"company": "Jio Platforms",
			"profile": "Software Development Engineer",
			"rounds": "3 rounds",
			"preparation": "Practice geeks for geeks questions ",
			"tips": null,
			"experience": null,
			"branch": "CE"
		},
		{
			"Name": "G Raghavender Reddy",
			"Roll Number": "CS18BTECH11011",
			"course": "B.Tech",
			"company": "Jio Platforms",
			"profile": "Manager",
			"rounds": "3 Rounds\n1st Round shortlist from resumes\n2nd Round Exam containing Mcqs from Cs subjects, Aptitude, English and 2 programming questions.\n3rd Round Final interview which consisted of 20-30 predict output questions and explaining them. Some familiar OS topics.",
			"preparation": "First round was resume shortlisting so maintaining CGPA was important.\nFor second round practising Cs fundamental questions and aptitude was important. For programming questions practising questions in any familiar programming language from Geeks for Geeks, Leetcode or Interviewbit helped me in clearing round.\nFinal round requires clear knowledge of programming language concepts such as pointers, data types etc,. CS subjects basic knowledge is also important.",
			"tips": "For written round quick solving of questions was required.\nFor interview round we need to stay alert and think properly.\n",
			"experience": "I mainly focused on problem solving while preparation. There are many online coding platforms. I practised problems from Hackerrank, Geeks for Geeks, Leetcode and Interviewbit.\nI started my preparation after 6th semester in July month. It was very late that's why I could not cover all problem solving concepts. But I tried hard and prepared. I registered for very less courses in 7th semester. So that I could get enough time for placement preparation.",
			"branch": "CS"
		},
		{
			"Name": "Laxman Bandi ",
			"Roll Number": "ee18btech11049",
			"course": "B.Tech",
			"company": "Meesho",
			"profile": "SDE -1  , Banglore ",
			"rounds": "Online assessment : 3 coding questions 1 ez + 1 medium + 1 hard . And 10 mcqs on computer core concepts (+3 -3) .\n\n28 people got selected in the Written Test .\n\nRound 1 = \n2 coding questions hackerrank codepair . \n\nQ1 . Extension of number of islands . \n\nQ2 .  Given n . Return the number of possible arrays of size n  having values in the range 1-n.  Where each element in the array follows at least one of the 2 rules . \nRule 1 :- arr[idx] is divisible by index .\nRule 2 :- index is divisible by arr[idx] .\n\nI did both the questions .\n\nRound 2 : technical +  HR .  = \nQuestions on computer networks, DBMS, deep discussion in some of the topics. He simply wanted to pass time with me . \n\n I was the only one selected .\n",
			"preparation": "DS and algo should be the main focus. No need to do hardcore Competitive Programming. Medium to hard level leetcode, gfg question is enough for practice.   Make Sure to practice different kinds of questions. Mostly Questions will be an extension of problems available in leetcode. This should help you clear the Written test round. \n\nFor Technical Interview - Good understanding of CS Concepts . Be thorough in what you learn. Honestly, tell him that you haven't studied some topic. I skipped OS completely. \n\nFor HR: Make a note of all possible questions and answers.  Be Honest, don't over-exaggerate ",
			"tips": "Make a study Group  - helps you stay motivated. Practice mock interviews and mock Tests Online. ",
			"experience": "I used Leetcode. Finish blind 75 problem set (V.V imp ).  I started my preparation in September. Used myCodeSchool for DS",
			"branch": "EE"
		},
		{
			"Name": "GANDROTHULA ABHISHEK",
			"Roll Number": "EE20MTECH11001",
			"course": "M.Tech 2Y",
			"company": "Micron Technologies",
			"profile": "Product Engineer",
			"rounds": "I have gone through only one round. It's a Technical Round. They asked me questions related to my B.Tech and M.Tech courses. ",
			"preparation": "For technical round, you better thorough with the basics. And personally contact with the seniors, so that they will give some idea about what to prepare and the best sources. And also they will share their experience and preparation statergy. That's how our batchmates did... And one small tip for preparation is PREPARE FROM ATLEAST THREE MONTHS IN ADVANCE.",
			"tips": "Only one : Be Strong and confident in what you are saying. Communication Skills surely plays a key role (before that you should be good with your technical knowledge) ",
			"experience": "YouTube (80%) ... Textbooks prescribed by our seniors.",
			"branch": "EE"
		},
		{
			"Name": "Raj Surana",
			"Roll Number": "Sm20Mtech12003",
			"course": "M.Tech 2Y",
			"company": "Microsoft",
			"profile": "Software Developer",
			"rounds": "The first round was a coding round, 90 mins 3 questions. 2 Medium level Leetcode type and 1 question on medium-hard. Your timing matters with your accuracy. It took me around 40 minutes to solve all 3.\n\nAfter that company shortlisted around 50 students.\n\nThen on day 0, there were 3 interview rounds, 45 minutes each. The First 2 interview round were live coding rounds. Interviewers asked questions on a tree and linked list (again Medium Leetcode Level ). The third round had basic design questions and Os ( Operating system) questions.\n\nEverything went well got the final shortlist mail 5 minutes after leaving the third interview.",
			"preparation": "For coding, if you are a beginner, I suggest going for C++ (but python, Java, anything else will also be fine).\n\nLearn a language first from \"programiz.com\" or \"codesdope.com\" both have plenty of examples and practice while you learn new concepts.\n\nThen practice on Hackerrank first, try questions on the language you have selected. Try easy and Medium ones.\n\nAfter you feel comfortable with STL or your language library strat on Leetcode. Try solving easy questions of each topic first, nearly 5-10.\nThen switch to medium tag and solve around 10-15 questions from each topic. Take reference from GFG articles on Data Structures and Algorithm sections. They are excellent.\nSome popular YouTubers will be Aditya Verma, Dardev (graph), Code NCode, MIT 6.006 FALL 2011 lecutes, Abdul Bari, Tushar Roy.\n\nFor OS, DBMS try RBR lectures of GATE CSE. For SQL practice on \"sqltutorial.org\". For OOPS, DSA read GFG articles.\n",
			"tips": "Having some good projects on your resume will help in shortlisting. Prepare well in OS, DBMS, SQL, DSA, OOPS.\nOnce you get yourself shortlisted, your branch or background does not matter, so don't hesitate if you are not from a CS background. \n\nIn the end, it can be helpful to skim through questions, give per question 10 minutes. You will be able to quickly revise 30-40 questions per day (try GFG must-do questions for product-based companies list for quick revision). \n\nTry solving the question in one go, don't push compile button. If you are not confident in your solution, take your time ( In both, while practising Leetcode or giving live coding rounds).\n\nMost Importantly:-\nMaintain your coding streaks and try learning a new thing every day.",
			"experience": "I used all the free materials, and they were best and more than enough. \nI started coding on Jan'21, but you can prepare easily in 6 months from scratch. Coding rounds start typically from September end.\nPrepare with your friends. This will make it easy and fun. In the end, you will cherish all those challenges you faced.",
			"branch": "SM"
		},
		{
			"Name": "Rajesh Kumar",
			"Roll Number": "EW20MTECH11004",
			"course": "M.Tech 2Y",
			"company": "Namo eWaste Management Ltd.",
			"profile": "Management Trainee",
			"rounds": "Only interview ",
			"preparation": "Course work & Project ",
			"tips": null,
			"experience": null,
			"branch": "EW"
		},
		{
			"Name": "Prajwal",
			"Roll Number": "CS18BTECH11010",
			"course": "B.Tech",
			"company": "Oppo-Oneplus",
			"profile": "Software Engineer",
			"rounds": "Coding Round: Hacker earth- some MCQs and 3 medium - difficult questions.\nThere were 3 interview rounds. 1 technical , 1 Tech+ HR, 1 HR\nTech Interview(30 mins): Coin change DP variant, strings related z- algorithm modification\nTech + HR(30 mins): Experience in ML and python, coding expertise, about company, overview of projects, Kaggle expertise, ML knowledge\nHR Interview(20 mins): Normal HR questions, they will check if you are really into the company. Visit company website and lookup company values.\n\nCore subjects like DBMS, OS, CN were not asked but they were asked in many other companies.",
			"preparation": "Coding round was tough, After coding the major hurdle was the first interview. Convey your thought process to the interviewer and ask if it's the correct path and just follow their tips. 2nd & 3rd interviews were easy. I wasn't asked any ML related questions but they will check your ML background and Kaggle expertise. Coding questions in the interview were variations of standard questions, They asked DP+trees for other people. review DP, Trees and Strings thoroughly. ",
			"tips": "If you are shortlisted for many companies in a single slot, just choose the company you have a better chance with, the time slots will be so congested. I had a chance with Oracle and GS but I spent my time with sprinkler, which had a tedious process, I had  very less time with Oracle and GS. At the the end of 1st slot, I wasn't placed, luckily I had Oppo-oneplus in the next slot and I completely devoted my time in that, I asked my Zomato interviewer to end the interview to attend Oppo -Oneplus HR interview, It's ok to ask the interviewer to end the interview after 20-30 mins, if it's getting too late for the desired company. Plan ahead for the day and sort out your preferences beforehand.",
			"experience": "I practiced in Leetcode and GFG. InterviewBit is good too. I started my preparation late but in last 3 months, I practiced consistently, I used to follow Babbar and Striver(youtubers) sheets and made a solution sheet for many problems so that I could review later. Don't directly jump in to the optimal solution, Start from the brute force and sink in to the optimal solution. Some might get frustrated with rejections but just keep trying don't give up.",
			"branch": "CS"
		},
		{
			"Name": "Ria Francis",
			"Roll Number": "MD20MDES14035",
			"course": "M.Des",
			"company": "Optum",
			"profile": "User experience design",
			"rounds": "Task rounds followed by interview rounds ",
			"preparation": "Do the task well ",
			"tips": "Na",
			"experience": "Na",
			"branch": "MD"
		},
		{
			"Name": "Shubham",
			"Roll Number": "Sm20mtech12002",
			"course": "M.Tech 2Y",
			"company": "Oracle",
			"profile": "Application engineer",
			"rounds": "1st round:-  was asked one question related to binary search\n2nd round:- HR",
			"preparation": "Keep your DSA strong",
			"tips": null,
			"experience": null,
			"branch": "SM"
		},
		{
			"Name": "Piyush Kumar Uttam",
			"Roll Number": "ee18btech11036",
			"course": "B.Tech",
			"company": "Oracle",
			"profile": "SDE",
			"rounds": "The placement process had 1 written round and 2 rounds of interview followed by a light chit chat with HR(which can very well be to judge the candidate's character). The written round consisted of around 70 MCQs which had to be solved in 90 minutes. The mcq were based on DSA, OS, DBMS and OOPS. For oracle you would need to put more emphasis on trees(RB tree, AVL trees, etc).\nThe first interview round started with my introduction and a brief discussion on my CV. Then I was asked to solve a DSA question(leetcode:medium). Then we had a brief discussion on exception handling after which I was called for round 2 in which I was presented with an interesting puzzle(https://www.geeksforgeeks.org/puzzle-9-find-the-fastest-3-horses/). With a little help from interviewer I was able to find the solution. After a brief chit chat with HR my interview rounds concluded.",
			"preparation": "For written rounds, a through knowledge and practice of DSA is essential. Even if you have multiple projects or research experience, if you lack in DSA it becomes exponentially hard to land interviews. You need to be able to come up with solutions to unfamiliar problems and code it within the time constraints. Each problem will be different but most of them will follow some pattern or an overarching concept, hence you need to be able to identify the concept and relate them to questions done before. Timed practice really builds proficiency needed to crack these rounds. It is also very crucial to identify weak areas and practice on improving them. For me they were topics which used multiple concepts to solve, for example dp on trees, etc. Always try to solve problems one or two levels above your caliber. If you start getting bored, it is a good indicator to up the level of problems you are facing.Towards the end me and my friends used to filter questions on leetcode and do only the hard ones.This kept the challenge fresh in mind and improve the much needed code proficiency.\nIn the interviews it is important to think out loud as the interviewers are more interested in your thought process than your answers. Do not be hesitant to ask for hints and keep the interviewer involved in the solving process thereby making it a collaborative experience rather than a mundane viva session. Bluffing on resume is a bad idea as anything on it is a fair game and the interviewers will expect you to any question regarding the same. Make sure to revise all the projects listed there.\nHR rounds basically evaluate your soft and people skills as well as your response to uncertainties and challenges. A good resource for preparation is (https://www.indiabix.com/hr-interview/questions-and-answers/). A general pattern to answer HR questions is to display your optimistic attitude in dealing with problems with a calm demeanor. Your confidence will be challenged many times during the interview process. The interviewers will deliberately try to put you under pressure and challenge your solution at times. Don't get agitated or nervous and answer with confidence and humility.",
			"tips": "The placement process is a numbers game so you need to clear the written round of as many companies as possible to be placed in a good place. Always be clear while communicating with the interviewer and answer calmly and confidently. Also make sure you keep in touch with the company coordinator so that your interviews dont clash with each other. In the end it helps to keep in mind the role luck plays in the placement process so don't worry much if you botch an interview or two.",
			"experience": "As for material, the standard interview preparation sites are enough. Some good ones are leetcode, interview bit and codeforces. I started my preparation around mid August and was able to complete the programming track of interview bit and move to leetcode. ",
			"branch": "EE"
		},
		{
			"Name": "chilusani sai teja",
			"Roll Number": "Me18btech11007",
			"course": "B.Tech",
			"company": "Phable Care",
			"profile": "Associate software development ",
			"rounds": "Technical(questions on DSA and oops)and hr at once.",
			"preparation": "Programming,DSA,projects.",
			"tips": "Compitional programming ",
			"experience": "Online source(gfg,leetcode)",
			"branch": "ME"
		},
		{
			"Name": "Preetham Kalavakunta",
			"Roll Number": "CH20MTECH11002",
			"course": "M.Tech 2Y",
			"company": "PwC",
			"profile": "Technology Consultant",
			"rounds": "a)Screening test - This was an aptitude test. Here it consisted of quants, English, logical reasoning. Reasoning was pretty easy and very basic. English consisted of many reading comprehensions and arranging the jumbled sentences. The main part was quants which was the toughest. \nb) Interview Round1: They asked for intro and projects.\nInterview Round2: They tested what one knew about PwC and all.\nHr Round: It was just a part of the process for just name sake.\n",
			"preparation": "If you want to get into PwC start practicing quants section to clear written test. This section consisted of the table solving sums which were exact same models of CAT paper. So just practice PYQs of CAT for this particular has there were 10/15 questions in this section and solving this would almost mean you are qualified.\nFor reading comprehensions and jumbled sentences just practing any material online would help.",
			"tips": "Most importantly clearing Round1 interview would mean almost securing the job. So for that I observed these things were important \na)As interview is concerned they more or less see how good you are able to explain your project and what you have written in the CV although they might not know anything about it. So communicate in a very nice way. \nEg: I was a chemical engineering student but they asked about German language as I had a Diploma in it.\nb)Read about PwC their recent program and new areas where they were venturing into\n eg:\"The New Equation\" and go to the interview. This would differentiate you from others.\nc) Have patience on the interview day as it would start at 10 in the morning and end aat  9pm .",
			"experience": "I did not prepare anything specific except table solving sums after knowing this from other friends in other IITs.",
			"branch": "CH"
		},
		{
			"Name": "Sai Harsha Yelleni",
			"Roll Number": "cs19mtech11023",
			"course": "M.Tech RA",
			"company": "Qualcomm",
			"profile": "AI/ML Engineer",
			"rounds": "Written test, Technical round and Technical cum HR round",
			"preparation": "Basics of Machine learning, Deep Learning, Linear Algebra and Probability, Computer science fundamentals and programming related MCQ's were asked in written test. It had 60 questions with negative marking and few multiple answer questions were also there. For technical round, the interviewer directly asked questions on my projects and jumped into testing my depth of knowledge in ML, DL. then he gave me a hackerrank code pair link with test cases to pass. It was based on monotonic stack concept. after explaining him different approaches, he asked me to code the optimal solution and it passed all test cases. then again he tested me on ML, DL, OOPs, CS fundamentals. then he gave one more coding question on grid (given a grid of 0's and 1's, if a row has 0 anywhere, make entire row as 0's and similarly for columns). i explained optimal approach and coded it out. I forgot to code a corner case. but he said it's totally fine and moved forward. second round was taken by ML Lead, where he asked about resume specific questions and asked about how can i improve my projects( have atleast a couple of ways/ hypothesis).",
			"tips": "Be sure what you write on resume makes 100% sense to you so that you can answer extensive questions on them and even tell your viewpoints and future extensions which shows your ability to think beyond typical ways. Coding questions will be of medium level mostly. rarely they ask medium-hard. filter difficulty wise questions and solve without looking at tags (which topic the question is from). Be confident in giving answers to the interviewer. Think it as a \"conversation\" instead of \"some random person grilling you\". Mindset helps a lot.",
			"experience": "For coding questions: leetcode, interviewbit and geeksforgeeks. For ML: Mathemetics for ML book, pattern recognition book, Deep learning and ML course slides by Dr. Vineeth Balasubramanian, interview questions are available on sites like gfg, glassdoor, etc. I didn't give much time for ML, DL prep before Novemeber. After realizing many ML roles are there i gave 3 days to brush concepts. Challenges were choosing the right questions and preparing list of questions we couldn't solve on first go. It takes some time.",
			"branch": "CS"
		},
		{
			"Name": "VENKATESH E ",
			"Roll Number": "AI20MTECH14005",
			"course": "M.Tech 2Y",
			"company": "Qualcomm, Legato(PPO)",
			"profile": "ML Engineer @ Qualcomm, Associate AI Engineer @ Legato",
			"rounds": "Qualcomm (FULL TIME)\nRound 1 : They came for hiring different positions. I gave ML as my primary preference. So my first round was MCQs on basic ML Concepts. \nRound 2 : Coding Interview - 2 Easy - Medium level questions along with project discussions. Coding took 40 minutes and remaining 20 minutes discussion on projects. \nRound 3 : Scenario based questions, like how will you approach this problem statement, what models you prefer and why you prefer? My thesis is in NLP domain but interviewer questioned about some metrics on Computer vision and some basics on those. \nResult : Selected as ML engineer \n\nLegato (INTERNSHIP - Then converted to PPO) \nRound 1: MCQs with ML, DL and statistics \nRound 2: Just interviewer goes through my resume and asked all the key terms mentioned in resume along with project discussion \nRound 3: Discussion with manager, there was some HR questions along with project discussions. \nResult: Selected as Intern in AI Domain ",
			"preparation": "For MCQ round, you need to be good at basics. I started with all ML algorithms and DL algorithms and some important terms in these concepts(say backpropagation, optimizers, etc.) For statistics, take applied statistics subject and that is sufficient. \n\nInterview Preparation : Have one/two good projects and make sure you know end to end and all the concepts of whatever models that you have used.",
			"tips": "I used to give more time to coding in LEETCODE and for ML/DL interviews I take a concept and read more blogs on those concepts.",
			"experience": "Online tutorials and blogs \nI started from the month of July and I was at the beginner level in coding and continuous practice for 3+ months helps. \nSometimes you may get motivated by hectic schedules, but don't stop your flow. I gave more importance to placements rather than the thesis in semester. Though I regret that sometimes as I have a dip in my CGPA, finally got a good offer and it was worth it.",
			"branch": "AI"
		},
		{
			"Name": "Digant Parmar ",
			"Roll Number": "Ma18btech11006 ",
			"course": "B.Tech",
			"company": "Rakuten",
			"profile": "Software Engineer ",
			"rounds": ".",
			"preparation": "No",
			"tips": "No",
			"experience": "Nothing ",
			"branch": "MA"
		},
		{
			"Name": "Sawan Kumar",
			"Roll Number": "ME18BTECH11037",
			"course": "B.Tech",
			"company": "Riskcovry",
			"profile": "Software Engineer",
			"rounds": "There was total of 4 rounds:\nRound 1: It was an Online Assessment round conducted on HackerEarth consists of MCQ questions from Java, OOPs, OS, DSA in 1 hr.\nRound 2: This was a DSA round conducted on google meet started with quick introduction and then, I was given two questions to solve on Leetcode in 1 hr. One was medium level question (Spiral traversal of matrix) and another question was Hard level (Reverse Nodes in K-groups). I was able to solve both within the given time. Then interviewer asked me to explain the approach as well as Time and Space Complexity of the Solution.\nRound 3: This was also a Technical round conducted on MS Teams for 1 hr. I was given a coding question related to string for which i just asked to explain the approach. Then there was some questions related to OS, DBMS, SQL, CN, OOPs. Then, there was some discussions related to project. At the end, I was asked to solve a puzzle.\nRound 4: This was a HR Round. She asked questions like.. why do you want to join our company?, What do you know about the company?, Tell me about your family?, Do you have any questions for me?,...etc.",
			"preparation": "You should be able to clear Online Assessment Rounds if you have command on CP and DSA questions from Leetcode and GFG. and also prepare for MCQs from OOPs, Java, OS, DBMS, CN. Some companies also ask aptitude questions. \nFor Technical Rounds practicing DSA from Leetcode and GFG will be enough. you can also refer to Interviewbit if time left. Also go through CS fundamentals like CN, OS, DBMS, SQL.\nSolve some Puzzles also.",
			"tips": "Start your preparation as early as possible bcz you will be more confident during placement time if you have practiced alot. Try to be honest with the interviewer. If you don't know about any question just tell the interviewer that you are not familiar with it, interviewer will change the question bcz they will judge you based on the topic you know. Also go through the projects that you mentioned in your resume.",
			"experience": "I used GFG and Leetcode for my preparation. HackerRank for SQL. and I also followed some youtube channels like Aditya Verma, Saurabh Shukla, Love Babbar, Raj Vikramaditya, Apna college, Code with Harry. For CS subjects like OS, DBMS, CN, i followed GFG, JavaTpoint and Youtube channel Gate Smashers.\nI started my preparation in May 2021 (after the end of third year). Being short in time, I was not able to practice CP, I just focused on DSA and core CS subjects and also able to make a project based on React. The online classes helped me alot. I got more free time due to online classes which i used for placement preparation.",
			"branch": "ME"
		},
		{
			"Name": "Suneel Atmakuri",
			"Roll Number": "sm20mtech12016",
			"course": "M.Tech 2Y",
			"company": "Robert Bosch",
			"profile": "Autonomous Driving Engineer",
			"rounds": "Applicants were shortlisted on the basis of their CGP and resume screening. There was no extra assessment either in form of aptitude test or coding round. \n\nOn the day of the interview, we were sent a meeting link for the first round of the technical interview. Majority of the questions were around my previous projects and experiences in different internships. It was a really advantageous having interest and experience in the Autonomous Driving field. Beyond these, some questions were focused on concepts of Autonomous Vehicle sensors, algorithms, trends in the industry. Some core concepts of Machine Learning, Deep learning, Connected Vehicles etc were also touched. \n\nThen I was asked to explain one of my project in detail while sharing my screen to explain the idea, framework, algorithm and other details. One last question was to write a pseudo code for an automated parking problem.\n\nThe last round was more of a HR round where we discussed about my interests, hobbies, previous experiences, life at IIT Hyderabad etc.\n\nThe results were declared within roughly 10 mins after the final round.",
			"preparation": "For the Profile I applied, it wasn't any SDE role, but it's beneficial and helpful in the interview too by having some coding experience. Concepts of Autonomous Vehicles, Machine Learning, Artificial intelligence, techniques, sensors etc are a must to know. \n\nWould be a lot helpful if one has projects in the similar field.",
			"tips": "Be confident, concentrate on what you know than what you feel they want you to know. Don't take lot of time thinking something you are not sure about, just inform that you don't know about that particular concept. You are not supposed to know everything. Do prepare 2/3 questions to ask them based on company/profile/ clarification based on pre placement talk etc.",
			"experience": null,
			"branch": "SM"
		},
		{
			"Name": "Prathmesh Shivaji Khandve",
			"Roll Number": "ME17B21M100001",
			"course": "Dual Degree",
			"company": "SEDEMAC Mechatronics",
			"profile": "R&D Engineer",
			"rounds": "Round 1 - Exam \nRound 2 - Technical Interview (Difficulty Medium)\nRound 3 - Technical Interview (Difficulty Hard)",
			"preparation": "Round 1 - RC Circuits, Electrical basics, Basic Physics\nRound 2 - RC Circuits, Electrical and Mechanical basic understanding\nRound 3 - Electrical Circuits, Output Input relations, Probability",
			"tips": "Basics of Electrical and Mechanical Engineering must be clear. They check your approach to problem not only answer.",
			"experience": "Prepare from materials you have from courses you did. Start looking at problem from basics",
			"branch": "ME"
		},
		{
			"Name": "Vinod Choupal",
			"Roll Number": "ES18BTECH11023",
			"course": "B.Tech",
			"company": "SaaS Labs Us Inc",
			"profile": "SDE",
			"rounds": "I got the opportunity of giving the interview in walk-in. I gave one round of technical interview that run around 1.5 hr countinously . I made my project on FULL stack developemnet . Company was also looking for this role. They saw my project and they really liked it . We had a lot discussion on  it. I had created a food delivery website. They asked mysql query . They asked two coding qn one of them was related to DP famous qn array sum.",
			"preparation": "Analyse what is going wrong and work  on it . ",
			"tips": "Be patience .Just be cool and give ur 100% percent . ",
			"experience": "Right now you are reading my experience i had also same time when i was reading others experience and was very nervous that kaise hoga apna .  I started proper coding in May .Starting coding so much late was a biggest mistake. The thing is when i came to collge i was  very chill like everything is done no need to study further and seniors also used to say that cgpa does not matter but that is not true guys . I had courses c , data structure and algo in my 1st and 2nd year but i didn't studied it nicely because i was not knowing the importance of these courses and nobody told me that for placement u need to learn these courses and have to do competitive coding .I would say that placement is quiet easy if u know things earlier and start earlier but we actually start very late so sometimes it is hectic at last . I didn't get intern  because at that time i had not done any coding even in my friends circle no body was so much prepared and only some  people get intern . Actually people who get intern are smart they know things long ago and they will not tell you in normal conversation(joke) . Finally i started my placement prep after not getting intern and may be many of u will be on same pitch no worry apka bhai tumhara  placement karwayega. See almost everyone will get  placement but the thing which matters is CTC .Either you r in 1st year , 2nd year or in 3rd year start following the things which i m going to share next . I had not a good project or intern so i started working on to make a nice project for placement and this was my one of gold decision which finally landed me to get  24lpa in Saas Labs Us Inc . I saw many people saying project doesn't matter but that's totally not right . If you have relevant project then u have an edge or  u should have very good competitive coding skill to crack company . Intern matters but it's not like if u dont get intern then u will not get job but yeah if u did inten then u have an edge over others. For my project i chose full stack developement area inspired by my one of IITG friend and IITH friend Sarath . I will recommend u to make project on full stack because there is a lot of demand and a lot of company is vising for this. I would say full stack project is so powerful if u have good project on it and good knowledge then company can offer u without much trouble.  I learned full stack from codewithharry channel( an amazing and best content by IITD guy  link- https://www.youtube.com/watch?v=6mbwJ2xhgzM&list=PLu0W_9lII9agiCUZYRsvtGTXdxkzPyItg ) and did the same project .\nI designed my project in hurry in 2 month of 7th sem Jan and Feb. For c++ and Data structure u can see saurav sukla lecture (https://youtu.be/5uTQz43k4gg). i will recommend nptel lec for algorithm concept (https://youtu.be/gY0MwGLq9W8). And for competitive programming you must must watch Aditya verma all  video  (https://youtu.be/ntCGbPMeqgg) and i also and almost everyone watch it. As there are lot of coding qn so i would suggest u to solve  450 famous  love babbar sheet  coding qn (https://youtu.be/4iFALQ1ACdA) and i too did. You sometimes find difficulty in solving by ur own so never hesitate to take help ,at the end  u should know the things . As in coding test qns are not in straight and it will be  in story form and there will be time limitations so for that you try to solve some top qn (100-200 as much )  from leetcode with timer. There are lot of platform for practice i tried  almost each but  leetcode is best .Also do some qn from hackerearth because in this u have to write code from scratch but mostly u have to write function for that leetcode is good .  Don't waste time deciding platform you sometimes find the same qn and many asked qn will be seen they rarely invent qn .database and Sql is very important i was asked a lot .I used (https://www.w3schools.com/)  and  (https://youtu.be/kBdlM6hNDAE) for sql and dbms.If u do all these things u are well prepared .If ur placement is near try to revise more rather than exploring new things.  Some cs subject knowledge like oops , CN etc  is required so also read them well they are easy .You can try interviewbit if u have time .There are lot of things to do so it is necessary to start earlier .As we need motivation to do so much things so what i did was i formed a group of my 5 friends and listed 450 qn in sheet .All people have access to sheet and all people write the no of qn they are solving per day and that was the motivation . Everyone trying to solve as much as possible . So guys keep healty competition ,share knowledge with friends that will help together to grow. These are only things/mantra u need to do to grab a descent ctc. I got to know this very late but i suggest u to stick to it from now and prepare  100% and bade payar se tum fodoge. People  who do  not prepare only scare otherwise it is quite easy believe me .It is far easy than JEE advance, i realised later .\nYou can connect me on insta or fb for any query \nhttps://www.instagram.com/_vinod_iith_choupal_2960/ \nhttps://www.facebook.com/profile.php?id=100075288895150",
			"branch": "ES"
		},
		{
			"Name": "DATLA TANUSHA",
			"Roll Number": "EE20MTECH14002",
			"course": "M.Tech 2Y",
			"company": "Silicon Labs",
			"profile": "Design engineer",
			"rounds": "Round 1 - technical\nRound 2 - technical\nRound 3 - HR",
			"preparation": "Analog digital basics",
			"tips": null,
			"experience": null,
			"branch": "EE"
		},
		{
			"Name": "Shreeshan S",
			"Roll Number": "ee19mtech01007",
			"course": "M.Tech RA",
			"company": "Silicon Labs",
			"profile": "Design Engineer 1",
			"rounds": "Silicon Labs interviewed on day -2 for Design Engineer 1 position,they did resume based shortlisting for the first round. In the second and third rounds, I got questions from the resume i.e. mainly on computer vision and DL and some questions from recent SOTA papers in my area.",
			"preparation": "Practice DSA problems on daily basis for 3-4 month as written round is mostly DSA based problems.\nBrush up resume, Core subjects and DSA for second round.",
			"tips": "Generally First round includes DSA, Aptitude(60% weightage), OS, DBMS and Some DL and ML questions (if the company is for DATA scientist/ML roles). \nFor the interview round, be thorough with your resume; most of the questions will be from your resume and some DSA question to check your logical thinking.",
			"experience": "Leet Code, Interviewbit for DS algo.\nOS and DBMS from Geek For Geeks.\nML and DL from Bishop and Medium Posts and Classroom Material.",
			"branch": "EE"
		},
		{
			"Name": "Kusuma Priya Pulavarty",
			"Roll Number": "ee20mtech11007 ",
			"course": "M.Tech 2Y",
			"company": "Silicon Labs",
			"profile": "Design Engineer",
			"rounds": "Resume selection, technical round-I, techincal round-II, HR round",
			"preparation": "Have to be thorough of everything on the resume including the relevant courses. ",
			"tips": null,
			"experience": null,
			"branch": "EE"
		},
		{
			"Name": "Vipin Kumar",
			"Roll Number": "MA20MSCST11002",
			"course": "M.Sc",
			"company": "Staart Buildtech Pvt Ltd",
			"profile": "Data analyst",
			"rounds": "Resume shortlist, technical interview and HR interview",
			"preparation": "Just follow tips from YouTube",
			"tips": null,
			"experience": null,
			"branch": "MA"
		},
		{
			"Name": "H B Chetan",
			"Roll Number": "ee19mtech11027",
			"course": "M.Tech RA",
			"company": "Steradian Semiconductors Private Limited",
			"profile": "Systems engineer",
			"rounds": "There was a written test and one round of technical interview.",
			"preparation": "revise your basics of communications and signal processing along with your coding skills",
			"tips": null,
			"experience": "class notes and internet",
			"branch": "EE"
		},
		{
			"Name": "Tahir Ahmed Shaik",
			"Roll Number": "CS2MTECH14007",
			"course": "M.Tech 2Y",
			"company": "TCS R&I",
			"profile": "Research Engineer",
			"rounds": "There were 3 rounds in all. One technical, HR and a Managerial round. The interview rounds were sequentially done in the single panel by different panelists. ",
			"preparation": "The prepration involved coding (Leetcode , Hackerrank (Easy and Medium) )and technical brushing up of basic CS topics (Data structures, Algorithms, DBMS, operating systems, Computer Networks). \nAlso learning about the projects in good detail.\n\nAdding research publications is a big plus.",
			"tips": "There was no written round. For the interview practicing coding , programming , syntax and library brushing of any one language comfortable with. Brush up core CS topics. ",
			"experience": "Not any specific material. Coding practice on Leetcode/ Hackerrank. Not very intense practice required. Just a few revisions and  learning coding syntaxes and technical things related to C , C++ on a major note.",
			"branch": "CS"
		},
		{
			"Name": "Dhananjay Mahobia",
			"Roll Number": "EE20MTECH11016",
			"course": "M.Tech 2Y",
			"company": "TSMC",
			"profile": "Physical design and APR Engineer",
			"rounds": "It was day (-2) company so 1st round was resume shortlisting and 2nd is final interview",
			"preparation": "For my profile one should have complete knowledge of VLSI design, Digital IC design, Physical design, STA, CDC, Verilog programming, tools like Cadence Virtuoso and Xilinx Vivado. ",
			"tips": "Confidence is the key to crack any interview, even if we go wrong somewhere, interviewer gives hint so we need to be really spontaneous to grasp that. They check approach not the not the final answer. ",
			"experience": "I studied everything, sounds crazy but yes, I have gone through complete VLSI subjects in deep depth, while preparation you'll face many challenges like Thesis, Interns etc but don't worry about them and just focus on your goal. I was focused for only one thing, 'I need to get placed in 1st company' bcz as we give multiple interviews, our brain and body gets tired so its better if we get placed early.",
			"branch": "EE"
		},
		{
			"Name": "Gajula Mahesh Babu",
			"Roll Number": "ME18BTECH11010",
			"course": "B.Tech",
			"company": "Tata Unistore",
			"profile": "SDE",
			"rounds": "2 rounds first round technical second round HR interview",
			"preparation": "Gfg",
			"tips": "Prepare your strong topics perfectly ",
			"experience": "Gfg leetcode ",
			"branch": "ME"
		},
		{
			"Name": "Nambi Sreekanth",
			"Roll Number": "EE20MTECH11002",
			"course": "M.Tech 2Y",
			"company": "Texas Instruments",
			"profile": "Analog Design Engineer",
			"rounds": "Written,Technical and HR round.",
			"preparation": "Basics of Network theory, RC, RLC circuits, Razavi Text book. Needs Intuition while solving problems during both written test and technical interview Instead of formula based approach.",
			"tips": " If you don't know about any particular concept or question during interview give a try to solve it if you are unable to solve, then you can ask them for hint Instead of passing over to next question.",
			"experience": null,
			"branch": "EE"
		},
		{
			"Name": "Archa V",
			"Roll Number": "Md20mdes14020",
			"course": "M.Des",
			"company": "ValueLabs",
			"profile": "Senior Visual Designer",
			"rounds": "1) Shirtlisting through CV and portfolio\n2) Portfolio interview round and shortlisting\n3) Design task\n4) Interview with SVP, ValueLabs",
			"preparation": "Explain a project that you are very confident and passionate about, that will make you stand apart",
			"tips": null,
			"experience": null,
			"branch": "MD"
		},
		{
			"Name": "Aswin. R",
			"Roll Number": "me19mtech01002",
			"course": "M.Tech 3Y",
			"company": "Whirlpool",
			"profile": "Senior engineer",
			"rounds": "Shortlist from resume, online test, technical round, HR round",
			"preparation": "Basics of thermal and fluids part for written test. Additionally, MTech project work knowledge for technical round.",
			"tips": "Mention subjects studied and project details clearly in resume. Should know the basics of thermal and fluids part for written test. The questions were direct type and scoring 27±2 out of 30 questions was possible. Additionally, MTech project work knowledge for technical round will be handy. Prepare commonly asked questions for HR round. Tech round lasted for 45 min to 1 hour. HR round for 10 minutes approx. (They expect fundamental knowledge and ability to apply in real world problems in technical round; Also they'll test how well you have understood the projects you've done)",
			"experience": "No special preparation is required. Just brush up your basics of thermal & fluid part of undergraduate syllabus. Focus on your MTech project well.",
			"branch": "ME"
		},
		{
			"Name": "Sonali Dulange",
			"Roll Number": "ee20mtech4001",
			"course": "M.Tech 2Y",
			"company": "Xilinx",
			"profile": "Design engineer",
			"rounds": "PPO",
			"preparation": null,
			"tips": null,
			"experience": null,
			"branch": "EE"
		},
		{
			"Name": "Balusupati Deepak",
			"Roll Number": "CE18BTECH11004",
			"course": "B.Tech",
			"company": "ZL Technologies India Pvt Ltd",
			"profile": "Software Engineer",
			"rounds": "\na.\tOnline Coding Test - October 21, 2021\nb.\tAnnouncement of shortlisted candidates - November 25, 2021\nc.\tInterview Rounds (Technical) - December 02, 2021 (09:30 PM to 10:40 PM)\nd.\tHR Interview - December 02, 2020 (10:40 PM to 11:10 PM)\ne.\tAnnouncement of placed candidates - December 03, 2021 (04:20 PM)",
			"preparation": "1.\tData Structures and Algorithms (This is enough for ZL Tech. They do not care below \n        topics)\n2.\tOperating Systems, DBMS & OOPS\n3.\tC/C++, Python, SQL programming experience\n4.\tProbability, Statistics Preparation Methodology:\n        a.\tSpend a lot of time in deciding which data structure(s) you are going to use in \n               solving the problems that you solve throughout your preparation. \n        b.\tHave a mapping in your mind of all algorithms and data structures, their \n               advantages, disadvantages, complexities etc. and connect them with the problem \n               that you are solving, which helps you optimize your approach. \n        c.\tAvoid watching YouTube videos (like dummies), instead read references/articles \n               and think (a lot) until you understand the algorithm. \n        d.\tDo not jump into the code editor before using your pen, paper, mind. \n        e.\tIn the beginning, it may take a lot of time to understand things, but it gets better. Do \n               not worry about wasting time. The only wastage of time is worrying about time \n               wastage.\n        f.\tFinally, the language. Use whatever language you prefer for competitive \n               programming but, if you do not know C/C++ it may cost you a job. (Happened to \n               one of my friends). So, do not be proud of yourself if you can draw fancy curves in \n               python (every idiot can do it) and start understanding/using C++ (earlier the better). \n               You are gonna love it.",
			"tips": "Online Round:-\na.\tMath / Aptitude – no preparation, tips required. Just go with the flow.\nb.\tCoding Tests – Most of them are standard questions decorated with bullshit. Be \n        thorough with standard algorithms (dijkshtra, knapsack, kadane’s, etc.) and take \n        time to think and figure out which data structure/algorithm can be used to solve the \n        problem. \nc.\tMake yourself extremely fluent with C++ containers and their functions. \nd.\tFirst read all the coding questions. Start solving the easiest first. Move to next problem \n        only if you successfully pass all (or most) of the test cases in current problem. \ne.\tDBMS, OS, OOPS, Python, C++/C are also asked. Read and understand the concepts.\n \nTechnical Rounds:-\na.\tMany (not all) of the technical interviews are basically online coding round except your \n        screen is shared and the interviewer interacts with you constantly. Be prepared for this. \nb.\tA fancy resume with lots of projects, skills, experiences etc. is not at all required. Just \n        put whatever you have learnt, in your resume. Make sure that you will be able to answer \n        any questions asked based on points from your resume. \nc.\tIn technical rounds, lengthy algorithms like backtracking, dynamic programming, etc. \n        were asked. So, revise these topics before attending technical rounds. \n\nHR Rounds Be prepared with your answers for these types of questions:-\na.\tWhy IT? Why our company? \nb.\tExplain a tough situation in your life and how you did you overcome it? \nc.\tAny plans for masters? (say no, obviously) \nd.\tWhy is your CGPA low? \ne.\tWhat are your aspirations? What do you want in your professional life?",
			"experience": "Materials Used:-\n1.\tAlgorithms Specialization (Stanford University - Coursera)\n2.\tData Structures and Algorithms Made Easy (Abdul Bari’s - Udemy) \n3.\tGeeksForGeeks (most of the algorithms here are copied from the above 2 platforms) \n4.\tC++ Documentation \n5.\tLeetCode My experience\n6.\tUsed to solve some easy problems randomly on leetcode in Third year of BTech.\n        a.\tLearnt Algorithms from Coursera (DP, D&C, Greedy) after 3rd year 2nd sem.\n        b.\tDid data structures thoroughly in 4th year 1st sem. \n        c.\tSolved problems on leetcode (medium/hard) in 4th year 1st sem. \n        d.\tRegistered for useful/interested CSE courses. \n7.\tChallenges\n        a.\tWas unable to solve difficult rated problems. Reason: Haven’t thoroughly prepared \n               all DS concepts from the beginning. \n        b.\tShortlisted for only 58% of the online tests written. Reason: Lack of CP practice.\n        c.\tEligibility: Only 108/186 positions were open for me because I am from Civil and \n               have no CS/EE minors. Try to get a CS/EE double major/minor which opens good \n               (Day 0/1) companies for you. (ZL Tech doesn’t care about your major) \n        d.\tCGPA: Mine was only 7.09 by the end of 3rd year which also affected my eligibility. \n               Try to maintain yours at least 7.5+ (ZL Tech doesn’t care about your CGPA)",
			"branch": "CE"
		},
		{
			"Name": "Rishabh Kumar Singh",
			"Roll Number": "MS18BTECH11019",
			"course": "B.Tech",
			"company": "Zomato",
			"profile": "Software development Engineer",
			"rounds": "Round 1:- Online coding round\nThis round consists of 4 questions to be done in 1 hour. The question difficulty level was medium to hard.\nRound 2:- Technical interview round\nThis round was based on DSA, OOPS. Interview went for around 1 hour. Total of 5 coding questions were asked, all were easy to medium level, topics including bit manipulation, dynamic programming, linked list and graph and to tell the correct time complexity with proper approach and after solving question they asked me to optimise and tell time complexity.\nLater i was asked oops concepts and some real life examples of it. Then he asked me about my internships and projects which I told them briefly.",
			"preparation": "Strong knowledge of DSA is must. If you are aware of algorithms and most of the data structures then it's easy to clear most of the rounds. I used gfg and leetcode for my practice. For interview, i asked my friends to take my mock interview and tell me my mistakes. For anyone who is preparing for placement, it's not hard to get an offer, be consistent and keep practicing.",
			"tips": null,
			"experience": null,
			"branch": "MS"
		}
	]
}
