{
	"walkthrough": [
		"Click 'Login | Register'",
		"Click on 'Student Portal'",
		"Register with your IITH email ID",
		"Fill in your details correctly and save. You can reset to original information too",
		"Select Academic Details",
		"Fill in your information regarding your schooling, JEE, current degree at IITH and Degrees prior to IITH",
		"Select Master CV",
		"Enter your detials for your master CV. Please note that your master CV will be verified and only then you can register to companies. So enter your information correctly",
		"Fill your details for each field individually by selecting them",
		"Save the results to your master CV. You can view the preview of your master CV before saving your information",
		"You can download and print your CV",
		"You will get a mail regarding the deadline to submit your master CV",
		"If there is any information that you submitted is incorrect, your master CV will be flagged and you will recieve an email regarding the same",
		"You will get a notification when your master CV has been verified. Now you can view all the available listings in the campus",
		"Click on Manage Documents",
		"Under Manage Documents, you can create individual CV for each listing",
		"Add a name to your CV",
		"You can see that a new CV has been created. Click on it to edit your CV",
		"Add only those fields from master CV which are relevant to the listing you are applying.",
		"You can rearrange the fields in the order you wish on your CV. Click on save to edit the CV. You can look the preview of the CV before editing. ",
		"You can Download the CV now",
		"Whenever there is a new listing in the college, you will get an email regarding it",
		"Go to 'Companies on Campus'",
		"You will see all the listings available in the campus. Check your eligibility and register to a company before the deadline",
		"Check all the details of the listing and register to the company",
		"Select the appropriate CV for the listing from the CVs you have created",
		"If you have registered successfully, you will see 'You are registered' under the status of registration ",
		"If a company shortlists you, you will see that the status of registration is updated to 'You are shortlisted'",
		"When your interview slot is decided, you will receive such email. Open the listing to check your slot timing and venue",
		"Your slot timing and venue are shown here",
		"Before your interview slot commences, you will receive an email about your interview list",
		"Your interview list is the list of students you are going to interview. Download the sheet",
		"You will have a list of students and their contacts. This is your interview list. You need to interview them",
		"After all the interviews, you will have to make a list of selected candidates and waitlist candidates",
		"Making selected list is the same process as making shortlist",
		"You need to upload it",
		"",
		"",
		"You can also upload 'Waitlist'. It is not mandatory, but highly recommended. Click the 'X' button if the waitlist is empty",
		"Your status is now updated. You will need to wait till the finalized list is made. You will be emailed when its done"
	],
	"gettingStarted": [
		"Click 'Login | Register'",
		"Click on 'Company Portal'",
		"Click on 'Register New Company'",
		"Fill in the details appropriately and click 'Register'",
		"You will have received an email in your registered email ID for email verification",
		"Click the button 'Verify Now' to verify your email",
		"If successful, you can now login to your newly created account",
		"Enter your credentials and login to the portal",
		"You will need to create a new listing now",
		"Whenever your student coordinator is alloted, you will be notified via email and you can look at their details in the homepage",
		"For creating a new listing, you need to fill out this form containing all the details",
		"Select all the degrees/programmes you would like to hire from",
		"You need to set options for every degree",
		"Enter the details, some textfields are multiline",
		"Check twice before creating, once you are sure, hit 'Create'",
		"If successful, you will see a list of all of your listings. Click on the listing's title to open it",
		"The current status of the listing is displayed on the top right corner. All your details you entered are visible down below. The first stage of status is 'Registration'. It means that students are registering for your listing"
	],
	"walkthroughButtons": [
		"Login",
		"Register",
		"Student Portal",
		"Current Portal",
		"Student Login",
		"gmail sign in",
		"personal information",
		"update information",
		"Academic",
		"Schooling",
		"degrees",
		"academic details",
		"master",
		"cv",
		"master",
		"cv",
		"master CV",
		"achievements and skills",
		"Rearrange",
		"save master CV",
		"Download CV",
		"print cv",
		"email",
		"master cv deadline",
		"email",
		"master cv flagged",
		"email",
		"master cv verified",
		"manage documents",
		"listings",
		"cv",
		"create new cv",
		"cv name",
		"create cv",
		"new cv",
		"cv name",
		"cv",
		"master cv",
		"save cv",
		"preview cv",
		"success notification",
		"download cv",
		"new listing",
		"email",
		"companies on campus",
		"all companies",
		"all companies",
		"all listings",
		"register to company",
		"job eligibility",
		"all cvs",
		"select cv",
		"you are registered",
		"unregister",
		"file",
		"you are shortlisted",
		"slot details",
		"interview slot",
		"email",
		"interview slot",
		"slot details",
		"email",
		"interview list",
		"interview list",
		"waitlist",
		"interview list",
		"student information",
		"selected candidates",
		"waitlist candidates",
		"shortlisting",
		"excel sheet",
		"shortlist file",
		"upload",
		"shortlist file",
		"upload file",
		"shortlist file",
		"upload file",
		"Waitlist",
		"upload waitlisted students",
		"finalized list",
		"email"
	]
}
